<!DOCTYPE html>
<!--[if lt IE 7]> <html class="ie6 ie"> <![endif]-->
<!--[if IE 7]>    <html class="ie7 ie"> <![endif]-->
<!--[if IE 8]>    <html class="ie8 ie"> <![endif]-->
<!--[if IE 9]>    <html class="ie9 ie"> <![endif]-->
<!--[if !IE]> --> <html lang="en"> <!-- <![endif]-->
<head>
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>
Fakhr al-Din al-Razi (Stanford Encyclopedia of Philosophy)
</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="robots" content="noarchive, noodp" />
<meta property="citation_title" content="Fakhr al-Din al-Razi" />
<meta property="citation_author" content="Adamson, Peter" />
<meta property="citation_author" content="Benevich, Fedor" />
<meta property="citation_publication_date" content="2023/02/05" />
<meta name="DC.title" content="Fakhr al-Din al-Razi" />
<meta name="DC.creator" content="Adamson, Peter" />
<meta name="DC.creator" content="Benevich, Fedor" />
<meta name="DCTERMS.issued" content="2023-02-05" />
<meta name="DCTERMS.modified" content="2023-02-05" />

<!-- NOTE: Import webfonts using this link: -->
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:400,300,600,200&amp;subset=latin,latin-ext" rel="stylesheet" type="text/css" />

<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap.min.css" />
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/bootstrap-responsive.min.css" />
<link rel="stylesheet" type="text/css" href="../../css/font-awesome.min.css" />
<!--[if IE 7]> <link rel="stylesheet" type="text/css" href="../../css/font-awesome-ie7.min.css"> <![endif]-->
<link rel="stylesheet" type="text/css" media="screen,handheld" href="../../css/style.css" />
<link rel="stylesheet" type="text/css" media="print" href="../../css/print.css" />
<link rel="stylesheet" type="text/css" href="../../css/entry.css" />
<!--[if IE]> <link rel="stylesheet" type="text/css" href="../../css/ie.css" /> <![endif]-->
<script type="text/javascript" src="../../js/jquery-1.9.1.min.js"></script>
<script type="text/javascript" src="../../js/bootstrap.min.js"></script>

<!-- NOTE: Javascript for sticky behavior needed on article and ToC pages -->
<script type="text/javascript" src="../../js/jquery-scrolltofixed-min.js"></script>
<script type="text/javascript" src="../../js/entry.js"></script>

<!-- SEP custom script -->
<script type="text/javascript" src="../../js/sep.js"></script>
</head>

<!-- NOTE: The nojs class is removed from the page if javascript is enabled. Otherwise, it drives the display when there is no javascript. -->
<body class="nojs article" id="pagetopright">
<div id="container">
<div id="header-wrapper">
  <div id="header">
    <div id="branding">
      <div id="site-logo"><a href="../../index.html"><img src="../../symbols/sep-man-red.png" alt="SEP home page" /></a></div>
      <div id="site-title"><a href="../../index.html">Stanford Encyclopedia of Philosophy</a></div>
    </div>
    <div id="navigation">
      <div class="navbar">
        <div class="navbar-inner">
          <div class="container">
            <button class="btn btn-navbar collapsed" data-target=".collapse-main-menu" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Menu </button>
            <div class="nav-collapse collapse-main-menu in collapse">
              <ul class="nav">
                <li class="dropdown open"><a id="drop1" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-book"></i> Browse</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop1">
                    <li role="menuitem"><a href="../../contents.html">Table of Contents</a></li>
                    <li role="menuitem"><a href="../../new.html">What's New</a></li>
                    <li role="menuitem"><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
                    <li role="menuitem"><a href="../../published.html">Chronological</a></li>
                    <li role="menuitem"><a href="../../archives/">Archives</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop2" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-info-sign"></i> About</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop2">
                    <li role="menuitem"><a href="../../info.html">Editorial Information</a></li>
                    <li role="menuitem"><a href="../../about.html">About the SEP</a></li>
                    <li role="menuitem"><a href="../../board.html">Editorial Board</a></li>
                    <li role="menuitem"><a href="../../cite.html">How to Cite the SEP</a></li>
                    <li role="menuitem"><a href="../../special-characters.html">Special Characters</a></li>
                    <li role="menuitem"><a href="../../tools/">Advanced Tools</a></li>
                    <li role="menuitem"><a href="../../contact.html">Contact</a></li>
                  </ul>
                </li>
                <li class="dropdown open"><a id="drop3" href="#" class="dropdown-toggle" data-toggle="dropdown" role="button"><i class="icon-leaf"></i> Support SEP</a>
                  <ul class="dropdown-menu" role="menu" aria-labelledby="drop3">
                    <li role="menuitem"><a href="../../support/">Support the SEP</a></li>
                    <li role="menuitem"><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
                    <li role="menuitem"><a href="../../support/donate.html">Make a Donation</a></li>
                    <li role="menuitem"><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
                  </ul>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </div>
    <!-- End navigation -->
    
    <div id="search">
      <form id="search-form" method="get" action="../../search/searcher.py">
        <input type="search" name="query" placeholder="Search SEP" />
        <div class="search-btn-wrapper"><button class="btn search-btn" type="submit" aria-label="search"><i class="icon-search"></i></button></div>
      </form>
    </div>
    <!-- End search --> 
    
  </div>
  <!-- End header --> 
</div>
<!-- End header wrapper -->

<div id="content">

<!-- Begin article sidebar -->
<div id="article-sidebar" class="sticky">
  <div class="navbar">
    <div class="navbar-inner">
      <div class="container">
        <button class="btn btn-navbar" data-target=".collapse-sidebar" data-toggle="collapse" type="button"> <i class="icon-reorder"></i> Entry Navigation </button>
        <div id="article-nav" class="nav-collapse collapse-sidebar in collapse">
          <ul class="nav">
            <li><a href="#toc">Entry Contents</a></li>
            <li><a href="#Bib">Bibliography</a></li>
            <li><a href="#Aca">Academic Tools</a></li>
            <li><a href="https://leibniz.stanford.edu/friends/preview/al-din-al-razi/">Friends PDF Preview <i class="icon-external-link"></i></a></li>
            <li><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-din-al-razi">Author and Citation Info <i class="icon-external-link"></i></a> </li>
            <li><a href="#pagetopright" class="back-to-top">Back to Top <i class="icon-angle-up icon2x"></i></a></li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</div>
<!-- End article sidebar --> 

<!-- NOTE: Article content must have two wrapper divs: id="article" and id="article-content" -->
<div id="article">
<div id="article-content">

<!-- BEGIN ARTICLE HTML -->


<div id="aueditable"><!--DO NOT MODIFY THIS LINE AND ABOVE-->

<h1>Fakhr al-Din al-Razi</h1><div id="pubinfo"><em>First published Sun Feb 5, 2023</em></div>

<div id="preamble">

<p>
Fakhr al-D&#299;n al-R&#257;z&#299; (1149&ndash;1210) was one of the
most innovative and influential thinkers in the first stage of what is
sometimes called &ldquo;post-classical&rdquo; Islamic thought. Along
with other major thinkers of the Islamic East in the twelfth century,
notably Ab&#363; l-Barak&#257;t al-Baghd&#257;d&#299; and
al-Suhraward&#299;, Fakhr al-D&#299;n reacted critically to the
philosophy of Ibn S&#299;n&#257; (Avicenna). He produced a voluminous
corpus that is often elusive in terms of conveying Fakhr
al-D&#299;n&rsquo;s own considered opinions, but is packed with subtle
philosophical argumentation on pretty well every aspect of Ibn
S&#299;n&#257;&rsquo;s thought. Fakhr al-D&#299;n did also stake out
distinctive positions of his own, for example with respect to the
problem of providing real definitions, the distinction between essence
and existence, the principles of physics, the unity of the human soul,
and the source of ethical norms. This abundant output in philosophy
was only one part of his life&rsquo;s work, which includes texts on
Islamic law, theology, astrology, and one of history&rsquo;s most
important commentaries on the Quran.</p>
</div> 

<div id="toc"><!--Entry Contents-->
<ul>
	<li><a href="#LifeWork">1. Life and Works</a></li>
	<li><a href="#LogiEpis">2. Logic and Epistemology</a></li>
	<li><a href="#Phys">3. Physics</a></li>
	<li><a href="#Meta">4. Metaphysics</a></li>
	<li><a href="#Psyc">5. Psychology</a></li>
	<li><a href="#Ethi">6. Ethics</a></li>
	<li><a href="#Bib">Bibliography</a>
	<ul>
		<li><a href="#PrimLite">Primary literature</a></li>
		<li><a href="#SecoLite">Secondary literature</a></li>
	</ul>
	</li>
	<li><a href="#Aca">Academic Tools</a></li>
	<li><a href="#Oth">Other Internet Resources</a></li>
	<li><a href="#Rel">Related Entries</a></li>
</ul>
<!--Entry Contents-->

<hr /></div>

<div id="main-text">

<h2 id="LifeWork">1. Life and Works</h2>

<p>
Fakhr al-D&#299;n al-R&#257;z&#299;&rsquo;s life was shaped by the
political situation in central Asia in the generations just before the
Mongol conquest of that region. He was born in the Persian city of
Rayy, near modern-day Tehran, in 1149 CE (544 of the Muslim calendar).
The name &ldquo;R&#257;z&#299;&rdquo; refers to this birthplace,
leading to potential confusion with other philosophers from Rayy,
including the earlier Ab&#363; Bakr al-R&#257;z&#299; (d. 920) and the
later Qu&#7789;b al-D&#299;n al-R&#257;z&#299; (d.1364). Fakhr
al-D&#299;n did not stay in Rayy, but traveled widely throughout
Persia and central Asia for the rest of his life in search of
education, patronage, and worthy intellectual opponents. In fact, he
did not need to venture far for his initial education. His father was
an expert in Islamic theology and law, a second-generation student of
the major Ash&#703;arite thinker al-Juwayn&#299; (d.1085). Thus the
young Fakhr al-D&#299;n was from early on trained in the rational
theology (<em>kal&#257;m</em>) of the Ash&#703;arite school and the
legal system of his father&rsquo;s Sh&#257;fi&#703;&#299; school. He
went on to study in Nishapur, where he first encountered the works of
al-F&#257;r&#257;b&#299; (d.950&ndash;51) and Ibn S&#299;n&#257;
(Avicenna, d.1037). Responding to the latter would become the central
project of his own philosophical career. At Mar&#257;gha, he studied
with the teacher Majd al-D&#299;n al-J&#299;l&#299; (d. after 1175).
Al-Suhraward&#299; (d. 1191), the famous founder of the
&ldquo;Illuminationist&rdquo; philosophical tradition, was also a
student of al-J&#299;l&#299;&rsquo;s.</p>

<p>
The mature career of Fakhr al-D&#299;n has been divided into three
phases in a recent detailed overview of his life (Griffel 2021:
264&ndash;303; see also Street 1997, Griffel 2007, Alta&#351; 2013a
and 2013b, Shihadeh 2022). These phases were marked by patronage
relationships with two political powers who were vying for dominance
in central Asia, the Khw&#257;razm-Sh&#257;hs and the Gh&#363;rids.
Fakhr al-D&#299;n first enjoyed the support of the
Khw&#257;razm-Sh&#257;hs for about two decades, before joining the
Gh&#363;rids in 1197 after a military defeat of the
Khw&#257;razm-Sh&#257;hs at the hands of the Gh&#363;rids. By all
accounts this led to great wealth and standing, as Fakhr al-D&#299;n
became an ornament to the Gh&#363;rid court and a close companion and
teacher of the sultan Ghiy&#257;th al-D&#299;n (d.1203). This did not
mean he could stay above the political fray, though. He was accused of
lingering loyalty to the enemies of the court and was also involved in
a religious rivalry between Ash&#703;arism and the more literalist,
less rationalist Karr&#257;mite theological movement. His travels in
Transoxania seeking out debates with other jurists and theologians
have similarly been explained as an attempt to promote Ash&#703;arite
<em>kal&#257;m</em> against Matur&#299;d&#299; opponents, and
Sh&#257;fi&#703;&#299; legal thought against Hanbal&#299; opponents
(for his legal thought see, e.g., Opwis 2012, Ba&#351;o&#287;lu 2014).
In a record of these encounters around the year 1186, called
<em>Debates</em> (<em>Mun&#257;&#7827;ar&#257;&#7789;</em>), Fakhr
al-D&#299;n presents himself as &ldquo;the only respectable scholar
among a swarm of dimwits&rdquo; (Griffel 2021: 296; for this work see
Kholeif 1966). At the end of his life, we see a third phase of
patronage as he rejoins the Khw&#257;razm-Sh&#257;hs after they take
the city of Herat from the Gh&#363;rids. Fakhr al-D&#299;n died two
years later in that city, in 1210 CE (606 of the Muslim calendar).</p>

<p>
Despite his extensive travels and political maneuvering, Fakhr
al-D&#299;n found time to compose a startlingly large body of work.
Many will associate his name most immediately with his titanic
<em>Great Commentary on the Quran</em> (also called <em>Keys to the
Hidden</em>: <em>Maf&#257;&#7789;ih al-ghayb</em>). The modern
printing runs to no fewer than 32 volumes (here it is almost
obligatory to cite Ibn Taymiyya&rsquo;s barb that the work
&ldquo;contains everything apart from exegesis of the Quran&rdquo;).
Fakhr al-D&#299;n wrote extensively on law, theology, and
&ldquo;occult sciences&rdquo; like magic and astrology. As can be
learned from studies of his Quranic commentary (Jaffer 2015) and a
treatise of his on the occult disciplines (Noble 2021), every work of
Fakhr al-D&#299;n al-R&#257;z&#299; can be profitably read with his
philosophical interests in mind. But in this overview we will largely
restrict our focus to the theological-philosophical treatises that are
of most evident importance for the historian of philosophy. Scholars
sometimes refer to these as <em>summae</em>, which suggests a parallel
with Latin scholastic works like those by Thomas Aquinas. The
comparison is not misleading, insofar as Fakhr al-D&#299;n was
avowedly a theologian, but one who pursued philosophical problems at
length and with great sophistication.</p>

<p>
A couple of problems confront anyone who is trying to come to grips
with his writings in this area. First, the sheer quantity of material.
His first <em>summa</em>, entitled <em>Eastern Points of Investigation
on Metaphysics and Physics</em> (<em>al-Mab&#257;&#7717;ith
al-mashriqiyya f&#299; &#703;ilm al-il&#257;hiyy&#257;t
wa-l-&#7789;ab&#299;&#703;iyy&#257;t</em>) is more than 1200 pages
long in the modern printing. His final <em>summa</em>, written in his
final years and arguably best representing his own views on a wide
range of topics, is the similarly titled <em>Exalted Topics of Inquiry
within Divine Science</em> (<em>al-Ma&#7789;&#257;lib
al-&#703;&#257;liya min al-&#703;ilm al-il&#257;h&#299;</em>) and is
printed in nine books bound in five volumes. In between these two
works we have, among other texts, the shorter but highly innovative
and influential <em>Mulakhkha&#7779; al-&#7717;ikma</em> (<em>Epitome
of Philosophy</em>) and not one but two exegetical works devoted to
Ibn S&#299;n&#257;&rsquo;s <em>Pointers and Reminders</em>
(<em>al-Ish&#257;r&#257;t wa-l-tanb&#299;h&#257;t</em>), a critical
abridgment from 1201 (<em>Lubab al-Ish&#257;r&#257;t</em>) and an
earlier, and very extensive, line-by-line critical commentary
(<em>Shar&#7717; al-Ish&#257;r&#257;t</em>).</p>

<p>
Fakhr al-D&#299;n&rsquo;s decision to devote such a detailed
commentary to a work by Ibn S&#299;n&#257; is historically revealing.
While his contemporary Sharaf al-D&#299;n al-Mas&#703;&#363;d&#299;
(d. before 1204) did compose a set of <em>Doubts</em>
(<em>Shuk&#363;k</em>) on the same text, the commentary of
al-R&#257;z&#299; on <em>al-Ish&#257;r&#257;t</em> seems to be the
first lemmatized exegesis of an Arabic philosophical work (see also
Wisnovsky 2013, Shihadeh 2014 and 2017), as had been devoted to
Aristotle in late antiquity and earlier Arabic philosophy. Even a
casual perusal of Fakhr al-D&#299;n&rsquo;s corpus makes clear that he
has identified Ibn S&#299;n&#257; as the chief representative of
<em>falsafa</em>, a word which is most naturally translated
&ldquo;philosophy&rdquo; (since it is likewise derived from the Greek
<em>philosophia</em>) but which really has a narrower meaning in this
period, since it is so closely tied to Ibn S&#299;n&#257;&rsquo;s
distinctive teachings. To be a <em>faylas&#363;f</em> is to uphold
such doctrines as the necessary and eternal emanation of the universe
from God. (A more generic word for the discussion of such issues,
without any particular doctrinal commitment, would be
<em>&#7717;ikma</em>, literally meaning &ldquo;wisdom&rdquo;; see
Griffel 2021.) While Fakhr al-D&#299;n follows his famous predecessor
and fellow Ash&#703;arite al-Ghaz&#257;l&#299; (d. 1111) in targeting
Ibn S&#299;n&#257; as the outstanding exponent of <em>falsafa</em>, he
does not go along with al-Ghaz&#257;l&#299;&rsquo;s idea that the
<em>fal&#257;sifa</em> were heretics and apostates from Islam.</p>

<p>
Instead, he seems to welcome the powerful challenge posed by Ibn
S&#299;n&#257;&rsquo;s thought, since it gives him something worthy of
his own considerable critical acumen and helps him to map out the wide
range of issues tackled in his <em>summae</em>. These fall into the
domains of logic, physics, psychology, ethics, and above all,
metaphysics (general survey in Zark&#257;n 1963). Indeed Fakhr
al-D&#299;n used metaphysics to restructure the curriculum of the
sciences, something we especially see in his <em>Mulakhkha&#7779;</em>
(Eichner 2007, 2009). This work adopts a new arrangement, which would
be influential on later thinkers. Fakhr al-D&#299;n first tackles
logic, then &ldquo;generalities (<em>al-um&#363;r
al-&#703;&#257;mma</em>)&rdquo;, then natural philosophy, and finally
philosophical theology. The second and fourth parts of the project
correspond to what is called general and special metaphysics in the
Latin scholastic tradition, and the parallel does not end there. Like
Duns Scotus, Fakhr al-D&#299;n offers an analysis of existence (the
central case of a metaphysical &ldquo;generality&rdquo;) by way of
disjunction, e.g., existence may be one or many, necessary or
contingent, infinite or finite, self-sufficient or dependent, etc.
While these contrasts are largely drawn from Ibn S&#299;n&#257;, Fakhr
al-D&#299;n innovates with his systematic use of the disjunctions to
structure general metaphysics. This also means, as we will see below,
that his discussions of metaphysics are by no means restricted to
raising and answering questions about God, as we might expect from a
&ldquo;theologian&rdquo;.</p>

<p>
In fact, while Fakhr al-D&#299;n&rsquo;s Ash&#703;arite sympathies are
often evident, and he does also write works that summarize
<em>kal&#257;m</em> teachings, he is not consistent in taking a clear
stance in favor of Ash&#703;arite <em>kal&#257;m</em> and against
Avicennan <em>falsafa</em>. Instead, the really stable feature of his
work is a method that is, again, reminiscent of Latin scholasticism
and its genre of disputed questions. His various <em>summae</em> are
organized into topics for inquiry (hence the use of words like
<em>mab&#257;&#7717;ith</em> and <em>ma&#7789;&#257;lib</em> in the
titles of the works), with arguments considered for and against every
conceivable stance that could be adopted on each topic. (The famous
Sufi poet al-R&#363;m&#299; compared this approach to &ldquo;tearing
science apart like bread and feeding it to the birds&rdquo;.) The fact
that no actual historical figure or school has adopted a possible
position will not prevent Fakhr al-D&#299;n from considering it.</p>

<p>
By using this &ldquo;dialectical&rdquo; procedure (Wisnovsky 2004,
Shihadeh 2005, Griffel 2011) Fakhr al-D&#299;n is able to stand in
judgment over the whole historical tradition leading up to him.
Alongside Ibn S&#299;n&#257; and other philosophers, notably the
slightly earlier Ab&#363; l-Barak&#257;t al-Baghd&#257;d&#299; (d.
1160s), the <em>kal&#257;m</em> tradition supplies him with a stock of
positions and arguments to rehearse and critique. He will thus
frequently refer in the third person to &ldquo;theologians
(<em>mutakallim&#363;n</em>)&rdquo;, as if this were a group that does
not include him. The upshot is that Fakhr al-D&#299;n puts himself
forward as the arbiter in debates that span the
<em>falsafa-kal&#257;m</em> divide. If he is not consistent in
adopting one or another teaching himself (many times, a lengthy
investigation in his works ends with only a brief statement of the
likeliest answer, or none at all, followed with a pious &ldquo;but God
knows best&rdquo;), this is perhaps because the exhaustive method of
testing arguments and doctrines is more important to him than the
assertion of any one doctrine.</p>

<h2 id="LogiEpis">2. Logic and Epistemology</h2>

<p>
In the Islamic world, representatives of <em>falsafa</em> largely
accept the traditional Aristotelian presentation of the manner of the
acquisition of knowledge. This is the Peripatetic <em>Organon</em>,
which starts from the predicables and moves through syllogistic to
demonstrative science and essential definitions. Fakhr al-D&#299;n,
however, presents a different structure for logic and epistemology,
which leaves the traditional organization of the <em>Organon</em>
behind. The new structure revolves around two ways of acquiring
knowledge, conceptualization (<em>ta&#7779;awwur</em>) and assent
(<em>ta&#7779;d&#299;q</em>) (El-Rouayheb 2019: 29).
&ldquo;Conceptualization&rdquo; stands for mentally entertaining a
concept, such as &ldquo;human&rdquo; or &ldquo;rational animal&rdquo;,
without ascribing any truth-value to it, while &ldquo;assent&rdquo;
stands for claiming that the human is rational animal in the real
world (Lameer 2006). Fakhr al-D&#299;n&rsquo;s reorganization of logic
and epistemology may have been one inspiration for later authors who
re-define the subject matter of logic as &ldquo;the objects of
conception and assent&rdquo; (El-Rouayheb 2012).</p>

<p>
Fakhr al-D&#299;n complements this picture with his critique of
definitions, a rejection of the intentional acquisition of knowledge
through conceptualization (Falaturi 1969, Ibrahim 2013, &Ouml;zturan
2018, Jacobsen Ben Hammed 2020, Benevich 2022a). According to the
traditional Aristotelian epistemology, wholly embraced by Ibn
S&#299;n&#257;, we know what a human is by acquiring a complete
definition of the essence of what it means to be a human, through a
combination of all inherent generic and specific aspects, for instance
&ldquo;being an animal&rdquo; and &ldquo;being rational&rdquo;. Fakhr
al-D&#299;n denies that this is how we learn what things are. For him,
as for his contemporaries Ab&#363; l-Barak&#257;t and
al-Suhraward&#299;, the best that we can hope to achieve with the
traditional Aristotelian-Avicennan approach is a nominal definition,
the explication of a meaning we have in our minds
(<em>Mu&#7717;a&#7779;&#7779;al</em>, 84; <em>Mulakhkha&#7779;</em>:
<em>Man&#7789;iq</em>, 106). By defining humans as &ldquo;rational
animals&rdquo;, we do not learn anything new about real humans.
Rather, we just explain what we meant by &ldquo;humans&rdquo; in the
first place.</p>

<p>
Fakhr al-D&#299;n&rsquo;s main argument against real definitions is a
reapplication of an old epistemological problem that goes back to
Meno&rsquo;s paradox in Plato (<em>Meno</em>, 80d6&ndash;10).
Al-R&#257;z&#299; formulates it as follows:</p>

<blockquote>

<p>
If one is not aware of the object of inquiry, inquiry is impossible.
For, if one is entirely unaware of something, the soul undertakes no
inquiry into it. If on the other hand one <em>is</em> aware of it,
inquiry is again impossible, since it is absurd to make something
available when it is already available (<em>ta&#7717;&#7779;&#299;l
al-&#7717;&#257;&#7779;il</em>).</p>
</blockquote>

<p>
<em>If someone says</em>: [the inquirer] is aware of [the object of
inquiry] in some respect or other, <em>I respond</em>: the respect in
which he is aware of it is distinct from the respect in which he is
not aware of it. [82] He cannot inquire into the first [respect],
since it is [already] available. Nor can he inquire into the second
[respect], since he is absolutely unaware of it
(<em>Mu&#7717;a&#7779;&#7779;al</em>, 81&ndash;82)</p>

<p>
How can we learn something new if we do not even know what to look
for; and if we already know what we are looking for, what sense does
it make to learn something new about it? Al-F&#257;r&#257;b&#299; and
Ibn S&#299;n&#257; mostly accepted the Aristotelian solution to the
paradox, namely that we can know something in one respect, and inquire
into it and learn something new about it in another respect (Black
2008, Marmura 2009). Fakhr al-D&#299;n rejects this solution, on the
grounds that the problem may be applied to each aspect individually.
If we do not know one aspect but already know another aspect, new
inquiry is impossible for both, with the two aspects falling prey to
the two different horns of the paradox.</p>

<p>
In his analysis of the acquisition of knowledge, Fakhr al-D&#299;n
addresses the traditional epistemological distinction inherited from
<em>kal&#257;m</em> between &ldquo;necessary&rdquo;
(<em>&#7693;ar&#363;r&#299;</em>) and &ldquo;acquired&rdquo;
(<em>iktis&#257;b&#299;</em>) knowledge. We receive
&ldquo;necessary&rdquo; items of knowledge as a given, whether or not
we want to do so. For instance, when I look at a red apple, I have no
power over seeing that the apple is red. I cannot just decide to see
it as blue. By contrast, acquired knowledge means that we are
intentionally involved in the acquisition of knowledge. I might for
instance try to learn why humans have certain features that belong to
them, though I need not do so (see further Abrahamov 1993, Radhi
Ibrahim 2013, Benevich 2022b). Fakhr al-D&#299;n goes against this
standard <em>kal&#257;m</em> account by denying the second type of
knowledge. According to him, we do not have any power over our
conceptualization of things, nor over any beliefs that derive from
conceptualization (<em>Arba&#703;&#299;n</em>, vol.1, 330&ndash;332).
Rather, all items of conceptualization and assent are given to us,
which in the occasionalist Ash&#703;arite framework means given
directly by God (Jacobsen Ben Hammed 2020, Benevich 2022a). We are
thus &ldquo;forced&rdquo; to have whatever knowledge we wind up
having. The nature of the objects known is not so clear: it has been
argued that for Fakhr al-D&#299;n we can only get to objects of
phenomenal experience (Ibrahim 2013), and also that for him we can get
at the things in themselves (Benevich 2022a). Either way, the
necessary items of knowledge are the primary data for epistemic
agents. We do not learn what humans are through an inquiry and by
producing essential definitions. We know what humans are through
direct experience, which is not up to us.</p>

<p>
For someone who denies that we can voluntarily acquire knowledge
through either conceptualization or assent, Fakhr al-D&#299;n devotes
surprising effort to discussing the ways of acquiring assents. He
introduces a few substantial innovations in the Avicennan theories of
the types of propositions and syllogistics. In fact, Fakhr al-D&#299;n
introduces several notions and distinctions that become standard in
the subsequent history of Arabic logic. Most of them are rooted in Ibn
S&#299;n&#257;&rsquo;s logical apparatus, but Fakhr al-D&#299;n makes
great effort to critically revise and re-organize them, creating the
foundations of what has been called &ldquo;revisionist Avicennan
logic&rdquo; (El-Rouayheb 2019: 68&ndash;69). One of the most
important innovations is Fakhr al-D&#299;n&rsquo;s suggestion that Ibn
S&#299;n&#257; failed to distinguish between the alethic and temporal
understanding of necessity. &ldquo;Every <em>A</em> is necessarily
<em>B</em>&rdquo; does not need to mean the same as &ldquo;Every
<em>A</em> is always <em>B</em>&rdquo;. With this distinction, Fakhr
al-D&#299;n creates what Street has called &ldquo;profusion of
propositional types&rdquo;, which would be extensively discussed in
the later period of Arabic logic (Street 2014, 2016; see further
Strobino &amp; Thom 2016).</p>

<p>
Another important contribution in logic is Fakhr al-D&#299;n&rsquo;s
distinction between two readings of the subject term of a proposition:
externalist (<em>kh&#257;rij&#299;</em>) and essentialist
(<em>&#7717;aq&#299;q&#299;</em>). When we say &ldquo;Every <em>A</em>
is <em>B</em>&rdquo; on the externalist reading, we mean that every
single thing which actually happens to be <em>A</em> in the real world
is <em>B</em>. On the essentialist reading, &ldquo;Every <em>A</em> is
<em>B</em>&rdquo; means &ldquo;everything, were it to be described as
<em>A</em>, would be <em>B</em>&rdquo; (<em>Mulakhkha&#7779;:
Man&#7789;iq</em>, 141&ndash;42). The distinction between the
externalist and the essentialist reading is Fakhr al-D&#299;n&rsquo;s
response to the earlier Arabic discussions of the subject term by
al-Far&#257;b&#299; and Ibn S&#299;n&#257;. Al-Far&#257;b&#299; was
credited with the ampliation of the subject term to the possible. In
other words, for him, &ldquo;Every <em>A</em> is <em>B</em>&rdquo;
means &ldquo;everything that is possibly <em>A</em>, is
<em>B</em>&rdquo;. Ibn S&#299;n&#257; was more restrictive:
&ldquo;Every <em>A</em> is <em>B</em>&rdquo; means &ldquo;everything
that is actually <em>A</em>, is <em>B</em>&rdquo;. This need not mean
&ldquo;everything that actually is <em>A</em> in <em>the real
world</em>&rdquo; but can also refer to whatever is actually described
as <em>A</em> in the mind (Street 2005, 2010, 2014, and 2016, cf.
Chatti 2016). Fakhr al-D&#299;n&rsquo;s distinction between the
essentialist and the externalist readings of the subject term may be a
reaction to Ibn S&#299;n&#257;&rsquo;s ampliation of the subject term
to include the mental realm. As we will see in
 <a href="">Section 4</a>,
 Fakhr al-D&#299;n denies mental existence, and hence requires
different formulation for the readings of the subject term that do not
refer to real-world actuality.</p>

<h2 id="Phys">3. Physics</h2>

<p>
Fakhr al-D&#299;n&rsquo;s treatment of the principles of physics
provides an illuminating example of his philosophical method. In his
various <em>summae</em> he addresses the same set of issues treated in
Ibn S&#299;n&#257;&rsquo;s physics, which are ultimately those already
addressed by Aristotle&rsquo;s <em>Physics</em>. Thus we get
considerations of body, motion, time, place, and void. Yet ideas from
the <em>kal&#257;m</em> tradition are brought into the mix too, and
sometimes allowed to prevail. Thus he usually upholds the atomism
shared by both the Mu&#703;tazilite and Ash&#703;arite schools of
<em>kal&#257;m</em> against the continuism of Ibn S&#299;n&#257;. In
other cases, Fakhr al-D&#299;n seems to be following the lead of
Ab&#363; Bakr al-R&#257;z&#299; (who was himself an atomist), as he
embraces a &ldquo;Platonic&rdquo; understanding of time and place,
according to which these are independent principles rather than
measurements and limits of bodies and their motions.</p>

<p>
The fundamental distinction in <em>kal&#257;m</em> physics is that
between the atomic substance (<em>jawhar</em>) or &ldquo;indivisible
part&rdquo;, on the one hand, and the accidental properties
(<em>a&#703;r&#257;&#7693;</em>) that belong to these atoms, on the
other hand (Dhanani 1994, Sabra 2006). As far back as the initial
reception of Greek philosophy into Arabic, <em>fal&#257;sifa</em> like
al-Kind&#299; (in a lost work) had rejected atomism in favor of
Aristotelian continuism. This is the view that every part of every
body, no matter how small, can in principle be divided into yet
smaller sub-parts. Ibn S&#299;n&#257; was also a strong opponent of
atomism (Lettinck 1988, McGinnis 2013, Dhanani 2015), and his
arguments provoked discussion in a number of twelfth century authors
(see, e.g., McGinnis 2019). Fakhr al-D&#299;n is thus joining a
long-running debate when he addresses the cogency of atomism. His
statements on the question present a typically confusing picture. He
seems to reject atomism in his &ldquo;philosophical&rdquo;
(<em>falsaf&#299;</em>, <em>&#7717;ikm&#299;</em>) works, only to
accept it in his <em>kal&#257;m</em> works (Zark&#257;n 1963:
67&ndash;98). However his late <em>summa</em>, the
<em>Ma&#7789;&#257;lib</em>, may show that he came to embrace
<em>kal&#257;m</em> atomism as his own considered view (Dhanani 2015;
see also Setia 2004 and 2006, and Baffioni 1982: 211&ndash;75; for his
opposition to hylomorphism see Ibrahim 2020).</p>

<p>
As a decisive consideration in favor of atomism he here states that,
if continuism were true, each body would have an infinity of parts, so
that a mustard seed could be &ldquo;stretched&rdquo; to coincide with
the whole universe (<em>Ma&#7789;&#257;lib</em> vol.6, 71; see Dhanani
2015: 102 for the passage). Another atomist argument is that if a true
sphere were to meet a true surface, it would make contact at an
indivisible point. We can further argue as follows:</p>

<blockquote>

<p>
Once it is established that the locus of contact is something
indivisible, the existence of the individual atom must be
acknowledged. For if we roll a sphere in a full circle on a plane
surface, there can be no doubt that as soon as one point of contact
ceases, contact is established with another
(<em>Ma&#7789;&#257;lib</em> vol.6, 48&ndash;9).</p>
</blockquote>

<p>
As this argument shows, the atoms under consideration here are akin to
geometrical points, rather than the very small, extended but
indivisible bodies proposed in ancient Greek atomism and by the
earlier Ab&#363; Bakr al-R&#257;z&#299;. This itself an inheritance
from the <em>kal&#257;m</em> tradition. Geometry was also used by some
to rebut atomism, so in both the <em>Ma&#7789;&#257;lib</em> and a
separate treatise dedicated to this issue (Alta&#351; 2015), Fakhr
al-D&#299;n sets out geometrical arguments against atomism and offers
counter-refutations.</p>

<p>
If he is indeed an atomist, it would make sense that he should believe
in the possibility of void, since in both classical and
<em>kal&#257;m</em> atomism these two doctrines are usually found
together. Ab&#363; Bakr al-R&#257;z&#299; and Ab&#363; l-Barak&#257;t
al-Baghd&#257;d&#299; were also proponents of the void, and both were
influential figures for Fakhr al-D&#299;n. On this topic, he seems to
be fairly consistent in upholding the possibility of void against
Aristotelian and Avicennan arguments for its impossibility (Adamson
2018a). For example, he rejects the Aristotelian argument that, if the
speed of motion is inversely proportional to the density of the
medium, then motion in a void would be infinitely fast:</p>

<blockquote>

<p>
If we assume that part of the [required] time is to accommodate the
motion in itself, and part of it to accommodate the hindrance, then
the motion in pure void will take place in that amount of time that is
appropriate to the motion as it is in itself. Motion occurring in a
plenum, meanwhile, will occur in that amount of time plus a further
amount of time, as rendered appropriate by whatever is in the interval
that offers [175] hindrance. So it is established that the conclusion
they sought to force [on the proponent of void, sc. that motion in a
void would be infinitely fast given the total lack of resistance] does
not follow (<em>Ma&#7789;&#257;lib</em>, vol.5,
174.19&ndash;175.1).</p>
</blockquote>

<p>
In other words, the density of the medium only slows the intrinsic
speed of the motion that it would have in a vaccuum, which is
finite.</p>

<p>
Void is defined either as a case in which two bodies fail to be in
contact, with no body between them (<em>Arba&#703;&#299;n</em> vol.2,
32) or as a space that has nothing placed within it
(<em>Ma&#7789;&#257;lib</em> vol.5, 155). Physical arguments provide
evidence that void is in fact not just possible but actually occurs,
as when two flat surfaces are pulled apart: it will take some time,
however minimal, until air rushes in to fill the empty space
(<em>Arba&#703;&#299;n</em> vol.2, 35). The second definition of void
just mentioned brings us to Fakhr al-D&#299;n&rsquo;s notion of space
or place, and already suggests his view that place is not dependent on
bodies, as Ibn S&#299;n&#257; had claimed (Adamson 2017). For Ibn
S&#299;n&#257;, following Aristotle, place is the inner boundary of a
containing body, for example the interior surface of a jug that
surrounds the water placed in the jug (Lammer 2018: &sect;5.3). Fakhr
al-D&#299;n subjects this conception to a barrage of criticisms, for
example that a jewel inside a bag would remain in the same
&ldquo;place&rdquo; even as it is being transported between cities
(<em>Ma&#7789;&#257;lib</em> vol.5, 147). Instead, place is for him
indeed &ldquo;space&rdquo; (<em>fa&#7693;&#257;&#702;</em>,
<em>&#7717;ayyiz</em>), which is independent of bodies and may be
either occupied by a body or not.</p>

<p>
We find a parallel between this idea about space and his account of
time (Setia 2008, Adamson 2018b, Adamson &amp; Lammer 2020). For Ibn
S&#299;n&#257; time is a measure of motion (&#703;Abd
al-Muta&#703;&#257;l 2003, McGinnis 2003 and 2008). In the first
instance it is the measure of the motion of the outermost heaven,
since this is the fastest motion in the cosmos, which accounts for the
apparent diurnal rotation of the fixed stars around the Earth. This,
for Fakhr al-D&#299;n, is the &ldquo;peripatetic&rdquo; account of
time. In his <em>Ma&#7789;&#257;lib</em> he refutes it and also a
variant of the view found in Ab&#363; l-Barak&#257;t, according to
which time is the measure of <em>existence</em> rather than motion.
Fakhr al-D&#299;n does at least agree that time is real. To establish
this he cites an old <em>kal&#257;m</em> idea that time offers a
coordination between independent events (<em>Mab&#257;&#7717;ith</em>
vol.1, 761; <em>Ma&#7789;&#257;lib</em> vol.5, 47), which is why it is
possible for me to arrange to meet with you tomorrow (one event) when
the sun rises (another event). But time&rsquo;s existence is not
supervenient on motions or cases of existence. Were that the case,
then we would have multiple, simultaneous times for the various
motions, which would need a superordinate time to coordinate them.</p>

<p>
Fakhr al-D&#299;n&rsquo;s discussions of time give us a nice example
of how his views developed, even while circling around the same set of
arguments (Adamson &amp; Lammer 2020). In the
<em>Mab&#257;&#7717;ith</em> he expresses an an agnostic point of
view:</p>

<blockquote>

<p>
I have not yet arrived at the realization of the truth about time, so
let your expectation from this book be a thorough examination and
report of whatever can possibly be said [about time] from all points
of view (<em>Mab&#257;&#7717;ith</em> vol.1, 761).</p>
</blockquote>

<p>
When he writes the <em>Mulakhkha&#7779;</em>, by contrast, he is
coming around to the view that beforeness and afterness are
&ldquo;items of consideration&rdquo; (<em>um&#363;r
i&#703;tib&#257;riyya</em>). Yet at the end of his career, he has
adopted the contrary view. Now he endorses what he says is
Plato&rsquo;s view of time: it is &ldquo;a substance subsisting in
itself and independent in itself&rdquo; (<em>Ma&#7789;&#257;lib</em>
vol.6, 76). The allusion to Plato presumably refers to the
<em>Timaeus</em>. He is apparently following his fellow philosopher of
Rayy, Ab&#363; Bakr al-R&#257;z&#299;, both in accepting the
independence of time and place and in seeing Plato as an authority for
that physical theory (Adamson 2021a: ch.5). One difference between the
two R&#257;z&#299;s, however, is that Fakhr al-D&#299;n makes it clear
that time and place are both created by God, and not
&ldquo;eternal&rdquo; principles. Thus his overall account of physics
envisions a created spatio-temporal framework within which bodies may,
but need not, exist.</p>

<h2 id="Meta">4. Metaphysics</h2>

<p>
Just as &ldquo;substance&rdquo; (<em>ousia</em>) may rightfully be
called the central notion of Aristotelian metaphysics, so is
&ldquo;existence&rdquo; (<em>wuj&#363;d</em>) the core notion of
Avicennan metaphysics. Ibn S&#299;n&#257;&rsquo;s metaphysics is a
study of the relationship between different kinds of things and the
mode of their existence, which ultimately results in identifying a
special, necessary mode of existence, which belongs to one being
alone, namely God (see, e.g., Bertolacci 2016). There are two core
doctrines of Ibn S&#299;n&#257;&rsquo;s metaphysics, both widely
discussed after him in the Islamic world, and both addressed by Fakhr
al-D&#299;n in detail: the distinction between essence and existence,
and the idea that God is sheer existence, necessary in all
respects.</p>

<p>
&ldquo;Existence&rdquo; refers for Ibn S&#299;n&#257; to the very fact
that things are, irrespective of what they are. For instance, it is
one thing for a red apple to be a red apple, and it is a completely
different thing for the red apple to <em>be</em>. To establish the
distinction between what things are (that is, their essence), and
whether they are (that is, their existence), Ibn S&#299;n&#257; uses
an argument from conceivability. We can conceive of a red apple
without knowing whether it exists, hence its existence must be
different from its essence (<em>I&scaron;&#257;r&#257;t</em>,
<em>nama&#7789;</em> 4, 266). But how should we understand this
distinction between essence and existence? In the post-Avicennan
tradition, there are two main answers to this question: the
distinction between essence and existence is real
(<em>&#7717;aq&#299;q&#299;</em>) or it is merely conceptual
(<em>i&#703;tib&#257;r&#299;</em>). The first answer requires that
there are two different items outside the mind, which together make up
the existent red apple. The second response means that there is just
one item in the extramental world, the existent red apple; but we can
analyse it conceptually into &ldquo;existence&rdquo; and &ldquo;red
apple&rdquo; (Wisnovsky 2012, Eichner 2011b).</p>

<p>
Within this debate, Fakhr al-D&#299;n seems to take the realist stance
that essence and existence are distinct outside the mind (Benevich
2017). For instance, he feels compelled to address one of the most
pressing issues for the realists. If essence and existence are
distinct in reality, does this mean that all essences are already
somehow out there before existence attaches to them? Fakhr al-D&#299;n
is not puzzled by that difficulty:</p>

<blockquote>

<p>
The essence as such (<em>min &#7723;ay&#7791;u hiya hiya</em>) is an
essence distinct from existence and non-existence. This does not imply
the subsistence of something existent in something non-existent
(<em>Arba&#703;&#299;n</em>, vol.1, 88).</p>
</blockquote>

<p>
The essence of the red apple as such (<em>min &#7717;aythu hiya
hiya</em>) is indeed prior to its existence. The essences of things,
considered as such, are in a different, third state of being, neither
existent nor non-existent (<em>Mab&#257;&#7717;ith</em>, vol.1, 129).
Of course, this does not mean that there are essences of red apples
hanging around before they even become existent. Just like Ibn
S&#299;n&#257;, Fakhr al-D&#299;n accepts that essence and existence
are extensionally identical: all instances of essence are also
instances of existence (Wisnovsky 2012). But Fakhr al-D&#299;n offers
a realist take on the Avicennan distinction by introducing a clear
priority of essence over existence; more recent interpreters disagree
as to whether this is faithful to Ibn S&#299;n&#257;&rsquo;s own
metaphysics (Bertolacci 2012, Benevich 2019b, Janos 2020).</p>

<p>
Fakhr al-D&#299;n consistently uses his theory of the priority of
essence over existence to discuss what Ibn S&#299;n&#257; considered a
special case, God. In Fakhr al-D&#299;n&rsquo;s understanding, for Ibn
S&#299;n&#257;, God&rsquo;s essence is just identical to His
existence. For Ibn S&#299;n&#257;, this would be the only way to
guarantee that God exists necessarily. For, if there were any
composition at all of <em>A</em> and <em>B</em>, <em>A</em> could fail
to be <em>B</em>, and <em>B</em> could fail to attach to <em>A</em>;
some further cause would be needed to guarantee the connection between
the two. Thus, the only way to secure that <em>A</em> is necessarily
<em>B</em> is just to say that <em>A</em> is <em>B</em>. That would
mean that God&rsquo;s essence is not even conceptually distinct from
God&rsquo;s existence. There is an obvious problem with this doctrine,
however. If God&rsquo;s essence is sheer existence, but existence also
belongs to, for example, a red apple, how is the existence of the red
apple different from the divine essence? Ibn S&#299;n&#257;&rsquo;s
reply depends on the notion of the analogy or modulation
(<em>task&#299;k</em>) of existence, whereby one kind of existence
belongs to the red apple and another kind belongs to&mdash;or rather,
just <em>is</em>&mdash;God (Treiger 2012, De Haan 2015, Druart 2014,
Zamboni 2020, Janos 2021). But Fakhr al-D&#299;n, again much like Duns
Scotus almost a century later, refuses to take this route. Instead, he
insists on the univocity of existence. Everything that exists, does so
in the same manner of existence. Thus Fakhr al-D&#299;n is also
compelled to deny the identity of essence and existence in God&rsquo;s
case. God&rsquo;s existence will still be necessary, because His
essence is such that it implies its own existence. So in God essence
is prior to existence. This priority should not bother or indeed
surprise us, since we just have learned that <em>all</em> essences are
prior to their existence. The upshot is that what is special about God
is His essence, not a unique kind of existence
(<em>Mu&#7717;a&#7779;&#7779;al</em>, 67; see further Mayer 2003,
Benevich 2020a).</p>

<p>
Fakhr al-D&#299;n&rsquo;s contribution to history of metaphysics
recalls not only Duns Scotus but also Thomas Aquinas. Like Aquinas, he
offers a taxonomy of proofs for God&rsquo;s existence, which becomes
standard in philosophy of the Islamic world after him. Fakhr
al-D&#299;n distinguishes between four mains proofs for God&rsquo;s
existence available to him at his time: from the contingency of
essences; from the temporal origination (<em>&#7717;ud&#363;th</em>)
of essences; from the contingency of attributes; and from the temporal
origination of attributes. The first argument may be easily identified
with Ibn S&#299;n&#257;&rsquo;s proof for God&rsquo;s existence, which
establishes the existence of the Necessary Being by reasoning from the
contingency of all beings in the world (Marmura 1980; Mayer 2001;
Zarepour 2022). The second argument is the <em>kal&#257;m</em>
cosmological argument. It argues for the existence of a Creator based
on the fact that the world came to be at some point. The third
argument, from the contingency of attributes, alludes to the fact that
everything in the world exists in a certain way, while it could have
easily been some other way. Therefore, there needs to be some agent
that determined how things would exist. Finally, the fourth argument
comes closest to what we would designate as a design argument. The
attributes of things in the world are not just one way when they could
have been different, but are in the best way possible. Hence, there
must be a wise agent who chose these marvelous features for the world.
Fakhr al-D&#299;n contends that the first argument, that is, Ibn
S&#299;n&#257;&rsquo;s argument for the existence of a Necessary Being
is more fundamental than all other arguments
(<em>Ma&#703;&#257;lim</em>, 42).</p>

<p>
So, while disagreeing with Ibn S&#299;n&#257; whether God&rsquo;s
essence and existence are identical, Fakhr al-D&#299;n does accept
that God is a Necessary Being. Still, probably due to his
<em>kal&#257;m</em> allegiances, he is not ready to accept that God is
a necessary being in all respects. For instance, Ibn
S&#299;n&#257;&rsquo;s God cannot know particular individuals.
Knowledge of what is happening right now while you are reading this
article would involve a change in God, since He would need to stop
knowing that you are reading this sentence as soon as you move on to
the next one. But if God changes, then He is not necessary in all
respects, since necessity implies immutability. So the only way for
God to know what happens in the world is to conceive of universal
rules, laws of nature, and causation, without knowing which of those
rules are being at work right now (Marmura 2005, Adamson 2005; cf.
Acar 2004 and Nusseibeh 2009). Following Ab&#363; l-Barak&#257;t and
al-Ghaz&#257;l&#299;, Fakhr al-D&#299;n rejects this line of
reasoning, on the grounds that change in God&rsquo;s knowledge is
merely relational (<em>Arba&#703;&#299;n</em>, vol.1, 198). Imagine
that you are standing still and something passes by you from right to
left; in such a case you do not change, but your relation to that
moving thing does change. Now, we need to imagine the same with
respect to God&rsquo;s knowledge the chain of events: it passes by God
and God observes it, without God essentially changing.</p>

<p>
This account of divine knowledge requires a very specific
understanding of knowledge and cognition. Fakhr al-D&#299;n
al-R&#257;z&#299;, again following Ab&#363; l-Barak&#257;t and
al-Ghaz&#257;l&#299;, defines cognition as a relational state
(<em>&#7717;&#257;la i&#7693;&#257;fiyya</em>). Fahr al-D&#299;n
opposes this theory to the representationalist theory of cognition,
commonly ascribed to Ibn S&#299;n&#257; at this time:</p>

<blockquote>

<p>
Perception does not just come down to the making of an impression. The
truth is rather that it is a relational connective state. For we know
self-evidently that we have seen Zayd, given that our visual capacity
faculty has a certain relation to him. Anyone who claims that the
object seen is not Zayd, who exists extramentally and is not seen at
all, and that the object seen is rather his representation
(<em>mi&#7791;&#257;l</em>) and likeness
(<em>&scaron;aba&#7717;</em>), has put into doubt the most important
and powerful items of necessary knowledge (<em>&Scaron;ar&#7717;
al-I&scaron;&#257;r&#257;t</em> vol.2, 233).</p>
</blockquote>

<p>
According to representationalism, cognition involves the inherence of
the cognized object in the object of cognition. For instance, when I
think of a red apple, the idea of a red apple must be
&ldquo;imprinted&rdquo; in my mind. For Fakhr al-D&#299;n, cognition
is a direct relation between the agent of cognition and the object of
cognition itself, that is, the red apple in itself.
Representations&mdash;if there are any&mdash;are not the objects of
cognition (Benevich 2019a, 2020b; Griffel 2021: 341&ndash;84).</p>

<p>
One may wonder how this theory could explain the cognition of
non-existent objects. To what does my mind relate when I think of a
phoenix, or of a square circle? Ibn S&#299;n&#257; introduced the
notion of mental existence in response to this kind of question. The
phoenix may fail to be existent <em>outside</em> the mind, but it
exists in my mind while I am thinking about it, again being imprinted
in my mind (Black 1997). Just as Fakhr al-D&#299;n rejects the
representationalist theory of cognition, he consistently rejects the
Avicennan notion of mental existence (<em>wuj&#363;d
dhihn&#299;</em>). For him, when I think of non-existent beings, I
just think of elements that constitute those beings and are observable
in the world. For instance, thinking of a square circle means thinking
of a square and a circle as if they were combined (Benevich 2018; on
the related issue of the &ldquo;paradox of the unknown&rdquo; see
Lameer 2014).</p>

<p>
With this relational theory of cognition in hand, Fakhr al-D&#299;n is
able to resolve the puzzle of how God knows about changing things.
Objects of cognition are external to the agent of cognition, so that
change in those objects and the subsequent change in the process of
cognition does not involve any change in the agent. Thus we can say
that God is a necessary being, but not necessary in all respects,
since His relational cognition of current events is constantly in the
process of change. Yet this implies no change in God&rsquo;s essence.
Moreover, we have seen above that Ibn S&#299;n&#257; suggests that God
has knowledge of universal rules of causation and natural laws. Fakhr
al-D&#299;n argues that precisely this kind of knowledge that Ibn
S&#299;n&#257; ascribes to God, that is, the knowledge of universal
rules and causation, results in knowing every single event in the
world at the time when it happens (<em>Ma&#7789;&#257;lib</em>, vol.3,
163&ndash;64).</p>

<p>
Fakhr al-D&#299;n&rsquo;s reasoning here presupposes a strictly
determinist account of the world. There is a causal explanation for
each event, and God knows it. And indeed, Fakhr al-D&#299;n is willing
to embrace determinism fully. For instance, with respect to human
actions, he argues that they are determined by the combination of our
motivations, beliefs, and capacities. We do not have control over any
of these (as we saw in Section 1, Fakhr al-D&#299;n insists that our
beliefs are not up to us); so we do not have any control over our
actions either (<em>Ma&#7789;&#257;lib</em>, vol.9, 35&ndash;43).
There are two important premises underlying Fakhr al-D&#299;n&rsquo;s
determinism, both borrowed from Ibn S&#299;n&#257;. One is that there
must be, for everything that exists but could have failed to exist,
some reason why it exists; this is said to &ldquo;preponderate&rdquo;
the thing to exist rather than not existing. Second, when that reason
is present, the phenomenon must inevitably happen. Therefore, in the
presence of our capacities and motivations, we have no choice but to
act, and do so necessarily (<em>Ma&#7789;&#257;lib</em>, vol.9,
21&ndash;23; <em>Mab&#257;&#7717;ith</em>, vol.2, 517; on
al-R&#257;z&#299;&rsquo;s theory of action see further Shihadeh
2006).</p>

<h2 id="Psyc">5. Psychology</h2>

<p>
A fundamental assumption of Aristotelian psychology is that the souls
of all living things are characterized by a range of
&ldquo;powers&rdquo; or &ldquo;faculties&rdquo; (Greek
<em>dunameis</em>, Arabic <em>quwan</em>). These powers account for
the distinction between plants, animals, and humans: plants have the
&ldquo;vegetative&rdquo; powers of nutrition, growth, and
reproduction; animals the powers of sensation, locomotion, and
imagination; humans alone (among embodied beings) have the power of
reason or intellect. Ibn S&#299;n&#257; made significant alterations
to this scheme, not least by introducing a theory of &ldquo;internal
senses&rdquo; to account for cognitive capacities lying between
sensation and full-blown intellection. But broadly speaking, he
adhered to the tradition of faculty psychology. Fakhr
al-D&#299;n&rsquo;s earlier contemporary Ab&#363; l-Barak&#257;t
al-Baghd&#257;d&#299; rejected this whole approach. For him the soul
is a unity and is the single subject of all cognition (Kaukua
2016).</p>

<p>
Fakhr al-D&#299;n agrees, and in several of his works offers arguments
intended to confirm Ab&#363; l-Barak&#257;t&rsquo;s thesis. The most
powerful of these is that the soul is capable of what we might call
&ldquo;hybrid judgments&rdquo;. These are modeled on the sort of case
considered already by Aristotle, that honey is both white and sweet:
here vision and taste might seem to be making a judgment about the
same object, suggesting that they belong to a single subject, which
could be the entire soul. Such is Aristotle&rsquo;s commitment to
faculty psychology, though, that he instead introduces a new power
within the soul (the &ldquo;common sense&rdquo;) to take
responsibility for judgments that involve more than one sense
modality. Or at least, this is how he was understood in the later
tradition.</p>

<p>
Fakhr al-D&#299;n argues, however, that the same pattern repeats
across all the faculties. For example, Ibn S&#299;n&#257; had drawn a
strict contrast between the human intellect and the lower cognitive
faculties, on the grounds that the former grasps universals while the
latter powers&mdash;from sensation to imagination and
memory&mdash;deal only with particulars. But, says Fakhr al-D&#299;n,
we are able to apply a universal to a particular (&ldquo;Zayd is
human&rdquo;). It must be the unified soul that is responsible for
such judgments:</p>

<blockquote>

<p>
When we perceive a particular individual human, we know that he is a
particular belonging to the universal &ldquo;human&rdquo; and not a
particular belonging to the universal &ldquo;horse&rdquo;. That which
judges a particular man to be a particular belonging to the universal
&ldquo;human&rdquo; and not a particular belonging to the universal
&ldquo;horse&rdquo;, must inevitably be perceptive of the particular
man, the universal &ldquo;human&rdquo;, and the universal
&ldquo;horse&rdquo;. And so that which perceives particulars is also
that which perceives universals (<em>Mab&#257;&#7717;ith</em> vol.2,
255; 345&ndash;6; <em>Shar&#7717; al-Ish&#257;r&#257;t</em> vol.2,
265&ndash;7; the unity of the soul is discussed in depth at
<em>Ma&#7789;&#257;lib</em> vol.7, 159ff).</p>
</blockquote>

<p>
Another point, which again is taken over from Ab&#363;
l-Baghd&#257;d&#299;, is that the human soul at least has a kind of
&ldquo;first person perspective&rdquo; on its cognitive actions. It is
capable of grasping itself directly&mdash;as argued by Ibn
S&#299;n&#257; himself in his famous &ldquo;flying man&rdquo;
argument&mdash;and of grasping itself as the subject of all its
cognitions. Note that, since these arguments all turn on active
cognition, Fakhr al-D&#299;n is willing to exempt the non-cognitive
vegetative powers from this unified soul (<em>Mab&#257;&#7717;ith</em>
vol.2, 256&ndash;7). But there is no division of powers distinguishing
the &ldquo;animal soul&rdquo; from the rational soul that is
distinctive of humans.</p>

<p>
This does not stop Fakhr al-D&#299;n from using Ibn
S&#299;n&#257;&rsquo;s method for proving that the human soul is an
immaterial substance (Adamson 2021b, Alpina 2021). Ibn
S&#299;n&#257;&rsquo;s proof inferred the rational soul&rsquo;s nature
from the nature of its objects: since it grasps indivisible
intelligible forms, it must itself be indivisible, and therefore not a
body. In this case Fakhr al-D&#299;n chooses not to refute the
Avicennan line of argument but to improve upon it, by adding further
arguments to show that intelligibles are indeed indivisible
(<em>Mab&#257;&#7717;ith</em> vol.2, 362&ndash;5, also
<em>Shar&#7717;</em> vol.2, 285&ndash;8). He does still worry that the
argument is incomplete: the rational soul could be indivisible but not
immaterial if it were an atom (<em>Ma&#7789;&#257;lib</em> vol.7, 62),
so the cogency of the argument will depend on showing that atomism is
incoherent (see above, Section 3). And even if we reject atomism,
Avicennan prime matter is arguably also indivisible
(<em>Shar&#7717;</em> vol.2, 295). Still Fakhr al-D&#299;n seems to be
at least well-disposed towards the idea that the soul&rsquo;s ability
to grasp intelligibles establishes its immateriality.</p>

<p>
Since this ability belongs to the entire, unified soul and not is just
one &ldquo;faculty&rdquo; that could exist on its own as a disembodied
mind, this should secure immateriality, and hence the prospect of
immortality, for the human soul. When he speaks about the nature of
the human soul, he sometimes says that it is a luminous substance that
fuses with the body like rosewater in rose petals or oil in sesame,
which seems to make it a kind of very subtle body but not, he says,
like those perceptible to the senses (for passages see Jaffer 2015:
192). But it other contexts, Fakhr al-D&#299;n seems to be ready to
embrace full-fledged substance dualism. For this conclusion he
typically uses argumentation based on introspection, such as his
version of Ibn S&#299;n&#257;&rsquo;s Flying Man argument, or the
immediate awareness of personal identity over time (see, e.g.,
<em>Ma&#7789;&#257;lib</em>, vol.7, 101; 105).</p>

<p>
What about animal souls? The arguments presented so far clearly blur
the sharp distinction that Ibn S&#299;n&#257; and other
<em>fal&#257;sifa</em> drew between human and animal souls. But Fakhr
al-D&#299;n goes further. In both his <em>Mulakhkha&#7779;</em> and
his <em>Ma&#7789;&#257;lib</em> he suggests that non-human animals
have intelligence that is not different in kind from human rationality
(Adamson &amp; Somma forthcoming, Virgi 2022). Animals are self-aware,
know that they persist through time, grasp universals, and can make
plans and solve problems. This does not necessarily mean that animals
are equal to humans in their intelligence. Rather there may be a
continuum of cognitive capacities, with some animals ranged further
away from humans, others closer to them. But</p>

<blockquote>

<p>
if what is meant by &ldquo;reason&rdquo; is any of the types of
intelligence, then this intelligence should be attributed to
[non-human] animals. (<em>Ma&#7789;&#257;lib</em> vol.7, 311)</p>
</blockquote>

<p>
He may have found this view plausible in part because, again following
Ab&#363; l-Barak&#257;t, he is open to the idea that even just within
the human &ldquo;species&rdquo; we have differences that amount to
distinctions in quiddity (<em>Ma&#7789;&#257;lib</em> vol.7, 141). So
from this point of view too, there is little reason to embrace a stark
opposition between human and non-human animal nature.</p>

<h2 id="Ethi">6. Ethics</h2>

<p>
One passage which makes that point is found in his <em>Book on the
Soul and Spirit</em> (<em>Kit&#257;b al-Nafs wa-l-r&#363;&#7717;</em>
86&ndash;7): humans differ so much in their character traits that one
may suspect they do not all share the same essence. That exemplifies
the approach of this separate treatise, which is to stage a joint
inquiry into ethics and the soul. One theme addressed here is the
improvement of our &ldquo;character traits
(<em>akhl&#257;q</em>)&rdquo;. This is hardly surprising: the
centrality of this concept in Arabic moral thinking was such that
ethics itself was referred to as <em>&#703;ilm al-akhl&#257;q</em>
(literally, &ldquo;the science of character traits&rdquo;). And
philosophers both before Fakhr al-D&#299;n, like Miskawayh (d.1040)
and Ya&#7717;y&#257; Ibn &#703;Ad&#299; (d.974), and after him, like
Na&#7779;&#299;r al-D&#299;n al-&#7788;&#363;s&#299; (d.1274), put
character traits in both the thematic focus of their writings on
ethics and the titles of those writings. These works are part of a
broadly Aristotelian tradition of virtue ethics, which encourages
readers to pursue excellent rather than base character. Ibn
S&#299;n&#257; also contributed to this tradition, as in two short
works called <em>On Ethics</em> (again<em>, F&#299; l-&#703;ilm
al-akh&#257;q</em>) and <em>On Governance</em> (<em>F&#299;
l-Siy&#257;sa</em>; for Ibn S&#299;n&#257;&rsquo;S influence on later
practical philosophy see Kaya 2014).</p>

<p>
Fakhr al-D&#299;n was of course aware of this approach to ethics, and
took an interest in the topic of virtue (al-Shaar 2012). But he was no
Aristotelian. Historically, we can say that he responds more to
<em>kal&#257;m</em> ethics; philosophically, we can say that he was a
consequentialist rather than a virtue theorist (for this the essential
reading is Shihadeh 2006; see also his 2016). Taking the historical
point first, as an Ash&#703;arite he is committed to what would now be
called a &ldquo;divine command theory&rdquo;. That is, the right
action is whatever is commanded by God, the wrong action is whatever
is forbidden. The Ash&#703;arite stance emerged as a critique of the
Mu&#703;tazilite position, which holds that certain types of action
are known to be wrong without recourse to revelation, for example
lying. We can always imagine circumstances in which
&ldquo;intrinsically wrong&rdquo; action types turn out to be right
after all, like lying to a tyrant to avoid betraying a prophet
(<em>Arba&#703;&#299;n</em> vol.1, 348). Therefore this
Mu&#703;tazilite theory is untenable.</p>

<p>
Fakhr al-D&#299;n&rsquo;s early works uphold a straightforward divine
command theory. But he comes to pair this with a hedonist and
consequentialist ethics, which assumes that pleasure is good for
humans and pain bad. To avoid a regress of normative explanation,
there must be some fundamental norm, and in Fakhr al-D&#299;n&rsquo;s
view hedonism provides that norm. The connection between hedonism and
Ash&#703;arite ethics is that God has promised us pleasure if we
follow His commands, and pain if we do not. Thus, the divine command
theory turns out to be justified on egoistic, consequentialist grounds
(Shihadeh 2016: 66). This also opens the prospect for determining what
we should do in the absence of a divine command: whatever is
&ldquo;beneficial&rdquo;, in other words pleasure-maximizing for the
agent. Because pleasure is now so central to his ethical theory, he
devotes significant attention to its nature, refuting the originally
Platonic &ldquo;restoration theory&rdquo; according to which all
pleasure is a return to a natural state from a harmful or painful
state (<em>Shar&#7717;</em> vol.2, 552&ndash;4). This analysis might
apply to the base pleasures of food or sex, but would not hold for
higher pleasures like the grasping of knowledge (see his <em>Epistle
Censuring the Pleasures of this World</em>, in Shihadeh 2016).</p>

<p>
If we again take his late work, the <em>Ma&#7789;&#257;lib</em>, as
our best evidence for Fakhr al-D&#299;n&rsquo;s final philosophical
views, then we can infer that he retained his commitment to
consequentialism. Characteristically, he itemizes arguments against
his own position and refutes them one by one
(<em>Ma&#7789;&#257;lib</em> vol.3, 66&ndash;9). For example, you
might encounter an ill person in a wasteland where no one else is
around to see, and help them. What pleasure are you getting out of
this? None, it would seem, yet you would and should do it nonetheless.
Fakhr al-D&#299;n explains that you would be acting on the principle
that, if you were in the same position as the unfortunate person, you
would want to be treated in the same way. This is not an appeal to
some kind of Kantian categorical imperative, but more like what we now
call &ldquo;rule utilitarianism&rdquo;. That is, we should act in such
a way that if people in general acted like this, pleasure would be
maximized and pain minimized (for a similar interpretation see
Shihadeh 2016: 80, who emphasizes that the motivation is
&ldquo;neither altruistic nor based on a sense of duty&hellip; but is
a self-centred, prudential motivation&rdquo;).</p>

<p>
This example shows that Fakhr al-D&#299;n was not simply reacting to
Avicennan <em>falsafa</em> by rehearsing an Ash&#703;arite
<em>kal&#257;m</em> view (though he does also refute Ibn
S&#299;n&#257;&rsquo;s proposal, inspired by Neoplatonism, that evils
are cases of non-being). He also applied his philosophical acuity to
reflect on, and modify, the Ash&#703;arite position. In the later
tradition he was sometimes accused of adopting skepticism. A
representative anecdote has him weeping after being disabused of
something he had formerly taken as certain truth and lamenting,
&ldquo;what is there to prove that all my beliefs are not of this
nature?&rdquo; (quoted at Kholeif 1966: 18). The impression of
skepticism could also be encouraged by his tendency to provide only a
minimal verdict, or no verdict at all, at the end of a lengthy
dialectical investigation of some issue. This is something else that
annoyed later readers: the sheer accumulation of arguments he offered
for unacceptable views was dangerous, even if refutations of these
arguments were given thereafter. And it does seem that he saw certain
demonstration as being impossible on many theological and
philosophical issues. But he was not a global skeptic. As discussed
above, he had views about what it would mean to have knowledge, and
assumed that knowledge is indeed attainable. His massive and still
inadequately explored corpus testifies to his determination to attain
that knowledge like no one else in his time, and thus to supplant Ibn
S&#299;n&#257; as the indispensable thinker of the Islamic world.</p>
</div>

<div id="bibliography">

<h2 id="Bib">Bibliography</h2>

<p>
For a full bibliography see:</p>

<ul class="hanging">

<li>Janos, Damien and Muhammad Fariduddin Attar, 2023, <em>A
Comprehensive, Annotated, and Indexed Bibliography of the Modern
Scholarship on Fakhr al-D&#299;n al-R&#257;z&#299;</em>, (Handbook of
Oriental Studies. Section 1 the Near and Middle East, 171),
Leiden/Boston: Brill.</li>
</ul>

<h3 id="PrimLite">Primary literature</h3>

<ul class="hanging">

<li>Ibn S&#299;n&#257; [Avicenna], <em>al-Ish&#257;r&#257;t
wa-l-tanb&#299;h&#257;t</em>, Mujtab&#257; l-Z&#257;r&#703;&#299;
(ed.), Qom: Bust&#257;n-i Kit&#257;b, 2008.</li>

<li>Plato, <em>Meno</em>, in John Burnet (ed.) <em>Platonis
opera</em>, vol. 3, Oxford: Clarendon Press, 1903.</li>

<li>al-R&#257;z&#299;, Fakhr al-D&#299;n, <em>al-Arba&#703;&#299;n
f&#299; u&#7779;&#363;l al-d&#299;n</em>, A&#7717;mad
&#7716;igj&#257;z&#299; al-Saqq&#257; (ed.), 2 volumes, Cairo:
Maktabat al-kull&#299;y&#257;t al-azhar&#299;ya, 1986.</li>

<li>&ndash;&ndash;&ndash;, <em>al-Ma&#703;&#257;lim</em>, in
<em>As&#702;ila Na&#487;m al-D&#299;n al-K&#257;tib&#299; &#703;an
al-Ma&#703;&#257;lim li-Fakhr al-D&#299;n al-R&#257;z&#299; ma&#703;a
ta&#703;&#257;l&#299;q &#703;Izz al-Dawla b. Kamm&#363;na</em>, Sabine
Schmidtke and Reza Pourjavadi (eds.), Tehran: Iranian Institute of
Philosophy &amp; Institute of Islamic Studies, Free University of
Berlin, 2007.</li>

<li>&ndash;&ndash;&ndash;, <em>al-Mab&#257;&#7717;ith al-mashriqiyya
f&#299; &#703;ilm al-il&#257;hiyy&#257;t
wa-l-&#7789;ab&#299;&#703;iyy&#257;t</em>, Mu&#7717;ammad
al-Mu&#703;ta&#7779;im bi-ll&#257;h al-Baghd&#257;d&#299; (ed.), 2
vols, Beirut: D&#257;r al-kit&#257;b al-&#703;arab&#299;, 1990.</li>

<li>&ndash;&ndash;&ndash;, <em>al-Ma&#7789;&#257;lib
al-&#703;&#257;liya min al-&#703;ilm al-il&#257;h&#299;</em>, ed.
A&#7717;mad &#7716;ij&#257;z&#299; al-Saqq&#257; (ed.), 9 vols,
Beirut: D&#257;r al-kit&#257;b al-&#703;arab&#299;, 1987.</li>

<li>&ndash;&ndash;&ndash;, <em>Mu&#7717;a&#7779;&#7779;al afk&#257;r
al-mutaqaddim&#299;n wa-l-muta&#702;akhkhir&#299;n min
al-&#703;ulam&#257;&#702; wa-l-&#7717;ukam&#257;&#702;
wa-l-mutakallim&#299;n</em>, &#7716;usayn Atay (ed.), Cairo:
al-Maktaba al-azhariyya li-l-tur&#257;th, 1991.</li>

<li>&ndash;&ndash;&ndash;, <em>al-Mulakhkha&#7779;:
al-Man&#7789;iq</em>, A. Qar&#257;malk&#299; and A.
Ashgar&#299;nizh&#257;d (eds.), Tehran: D&#257;ni&scaron;g&#257;h-i
Im&#257;m &#7778;&#257;diq, 2003.</li>

<li>&ndash;&ndash;&ndash;, <em>Al-nafs wa-l-r&#363;&#7717;</em>,
Muhammad &#7778;agh&#299;r &#7716;asan al-Ma&#703;&#7779;&#363;m&#299;
(ed.), Tehran, 1970.</li>

<li>&ndash;&ndash;&ndash;, <em>Shar&#7717; al-Ish&#257;r&#257;t
wa-l-tanb&#299;h&#257;t</em>, &#703;Al&#299; Re&#380;a Najafz&#257;dah
(ed.), 2 vols, Tehran: Anjuman-i s&#257;r va-Maf&#257;khir-i
Farhang&#299;, 2004-6.</li>
</ul>

<h3 id="SecoLite">Secondary literature</h3>

<ul class="hanging">

<li>&#703;Abd al-Muta&#703;&#257;l, &#703;A.D.M., 2003,
<em>Ta&#7779;awwur Ibn S&#299;n&#257; li-l-zam&#257;n
wa-u&#7779;&#363;luh&#363; al-y&#363;n&#257;n&#299;ya</em>,
Alexandria: D&#257;r al-waf&#257;&#702; li-duny&#257;
l-&#7789;ib&#257;&#703;a wa-l-na&scaron;r.</li>

<li>Abrahamov, Binyamin, 1992, &ldquo;Fakhr Al-D&#299;n
al-R&#257;z&#299; on God&rsquo;s Knowledge of the Particulars&rdquo;,
<em>Oriens</em>, 33: 133&ndash;155. doi:10.1163/1877837292X00051</li>

<li>&ndash;&ndash;&ndash;, 1993, &ldquo;Necessary Knowledge in Islamic
Theology&rdquo;, <em>British Journal of Middle Eastern Studies</em>,
20(1): 20&ndash;32.</li>

<li>Acar, Rahim, 2004, &ldquo;Reconsidering Avicenna&rsquo;s Position
on God&rsquo;s Knowledge of Particulars&rdquo;, in <em>Interpreting
Avicenna: Science and Philosophy in Medieval Islam</em>, Jon McGinnis
and David C. Reisman (eds), Leiden: Brill, 142&ndash;156.
doi:10.1163/9789047405818_011</li>

<li>Adamson, Peter, 2005, &ldquo;On Knowledge of Particulars&rdquo;,
<em>Proceedings of the Aristotelian Society</em>, 105(1):
257&ndash;278. doi:10.1111/j.0066-7373.2004.00114.x</li>

<li>&ndash;&ndash;&ndash;, 2011a, &ldquo;Avicenna and his Commentators
on Self-Intellective Substances&rdquo;, in Hasse and Bertolacci 2011:
97&ndash;122.</li>

<li>&ndash;&ndash;&ndash; (ed.), 2011b, <em>In the Age of Averroes:
Arabic Philosophy in the Sixth/Twelfth Century</em>, (Warburg
Institute Colloquia 16), London: Warburg Institute, School of Advanced
Study, University of London.</li>

<li>&ndash;&ndash;&ndash;, 2017, &ldquo;Fakhr Al-D&#299;n
al-R&#257;z&#299; on Place&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 27(2): 205&ndash;236.
doi:10.1017/S0957423917000029</li>

<li>&ndash;&ndash;&ndash;, 2018a, &ldquo;Fakhr al-D&#299;n
al-R&#257;z&#299; on Void&rdquo;, in <em>Islamic Philosophy from the
12<sup>th</sup> to the 14<sup>th</sup> Century</em>, Abdelkader Al
Ghouz (ed.), Bonn: Bonn University Press, 307&ndash;324.</li>

<li>&ndash;&ndash;&ndash;, 2018b, &ldquo;The Existence of Time in
Fakhr Al-D&#299;n al-R&#257;z&#299;&rsquo;s <em>Ma&#7789;&#257;lib
al-&#703;&#257;liya</em>&rdquo;, in <em>The Arabic, Hebrew, and Latin
Reception of Avicenna&rsquo;s Physics and Cosmology</em>, Dag Nikolaus
Hasse and Amos Bertolacci (eds.), (Scientia Graeco-Arabica 23),
Boston: De Gruyter, 65&ndash;99. doi:10.1515/9781614516972</li>

<li>&ndash;&ndash;&ndash;, 2018c, &ldquo;The Simplicity of
Self-Knowledge after Avicenna&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 28(2): 257&ndash;277.
doi:10.1017/S0957423918000048</li>

<li>&ndash;&ndash;&ndash;, 2021a, <em>Al-R&#257;z&#299;</em>, (Great
Medieval Thinkers), New York: Oxford University Press.
doi:10.1093/oso/9780197555033.001.0001 [Note: this book concerns
Ab&#363; Bakr al-R&#257;z&#299;, not Fakhr al-D&#299;n
al-R&#257;z&#299;, but the latter is often mentioned as a source for
the former.]</li>

<li>&ndash;&ndash;&ndash;, 2021b, &ldquo;From Known to Knower:
Affinity Arguments for the Mind&rsquo;s Incorporeality in the Islamic
World&rdquo;, in <em>Oxford Studies in Philosophy of Mind, Volume
1</em>, Uriah Kriegel (ed.), Oxford: Oxford University Press,
373&ndash;396. doi:10.1093/oso/9780198845850.003.0013</li>

<li>Adamson, Peter and Andreas Lammer, 2020, &ldquo;Fakhr al-D&#299;n
al-R&#257;z&#299;&rsquo;s Platonist Account of the Essence of
Time&rdquo;, in Shihadeh and Thiele 2020: 95&ndash;122.</li>

<li>Adamson, Peter and Bethany Somma, forthcoming, &ldquo;Fa&#7723;r
Al-D&#299;n al-R&#257;z&#299; on Animal Cognition and
Immortality&rdquo;, <em>Archiv F&uuml;r Geschichte Der
Philosophie</em>, first online: 14 July 2022.
doi:10.1515/agph-2021-0171</li>

<li>Ahmed, Asad Q., 2016, &ldquo;The Reception of Avicenna&rsquo;s
Theory of Motion in the Twelfth Century&rdquo;, <em>Arabic Sciences
and Philosophy</em>, 26(2): 215&ndash;243.
doi:10.1017/S0957423916000023</li>

<li>Alpina, Tommaso, 2021, <em>Subject, Definition, Activity: Framing
Avicenna&rsquo;s Science of the Soul</em>, Berlin, Boston: De Gruyter.
doi:10.1515/9783110706840</li>

<li>Alta&#351;, E&#351;ref, 2009, <em>Fahreddin
er-R&acirc;z&icirc;&rsquo;nin &#304;bn S&icirc;n&acirc; yorumu ve
ele&#351;tirisi</em>, &#304;stanbul: &#304;z
Yay&#305;nc&#305;l&#305;k.</li>

<li>&ndash;&ndash;&ndash;, 2013a, &ldquo;Fahreddin
er-R&acirc;z&icirc;&rsquo;nin Hayati, H&#257;mileri &#304;ilm&#299; ve
Siyas&#299; &#304;li&#351;kileri&rdquo;, in &Ouml;. T&uuml;rker and O.
Demir (eds.), <em>&#304;slam d&uuml;&#351;&uuml;ncesinin
d&ouml;n&uuml;&#351;&uuml;m &ccedil;a&#287;&#305;nda Fahreddin
er-R&acirc;z&icirc;</em>, Istanbul, &#304;sam Yay&#305;nlar&#305;,
41&ndash;90.</li>

<li>&ndash;&ndash;&ndash;, 2013b, &ldquo;Fahreddin
er-R&acirc;z&icirc;&rsquo;nin eserlerinin kronolojisi&rdquo;, in
&Ouml;. T&uuml;rker and O. Demir (eds.), <em>&#304;slam
d&uuml;&#351;&uuml;ncesinin d&ouml;n&uuml;&#351;&uuml;m
&ccedil;a&#287;&#305;nda Fahreddin er-R&acirc;z&icirc;</em>, Istanbul:
&#304;sam Yay&#305;nlar&#305;, 91&ndash;164.</li>

<li>&ndash;&ndash;&ndash;, 2015, &ldquo;An Analysis and Editio
Princeps of Fa&#7723;r al-D&#299;n al-R&#257;z&#299;&rsquo;s
Ris&#257;lah: <em>Al-Jawhar al-Fard</em>&rdquo;, <em>Nazariyat</em>,
1(3): 77&ndash;178. doi:10.15808/Nazariyat.2.3.M0018</li>

<li>Arnaldez, Roger, 2002, <em>Fakhr al-D&icirc;n al-R&acirc;z&icirc;:
commentateur du Coran et philosophe</em>, Paris: J. Vrin.</li>

<li>Baffioni, Carmela, 1982, <em>Atomismo e antiatomismo nel pensiero
islamico</em>, Naples: Instituto Universitario Orientale.</li>

<li>Ba&#351;o&#287;lu, Tuncay, 2014, <em>F&#305;k&#305;h Usul&uuml;nde
Fahreddin er-Razi Mektebi</em>, &#304;stanbul: &#304;sam
Yay&#305;nlar&#305;.</li>

<li>Benevich, Fedor, 2017, &ldquo;The Essence-Existence Distinction:
Four Elements of the Post-Avicennian Metaphysical Dispute
(11&ndash;13th Centuries)&rdquo;, <em>Oriens</em>, 45(3&ndash;4):
203&ndash;258. doi:10.1163/18778372-04503004</li>

<li>&ndash;&ndash;&ndash;, 2018, &ldquo;The Reality of the
Non-Existent Object of Thought: The Possible, the Impossible, and
Mental Existence in Islamic Philosophy (Eleventh&ndash;Thirteenth
Centuries)&rdquo;, <em>Oxford Studies in Medieval Philosophy</em> 6:
1&ndash;34</li>

<li>&ndash;&ndash;&ndash;, 2019a, &ldquo;God&rsquo;s Knowledge of
Particulars: Avicenna, <em>Kal&#257;m</em>, and the Post-Avicennian
Synthesis&rdquo;, <em>Recherches de Th&eacute;ologie et Philosophie
M&eacute;di&eacute;vales</em>, 86(1): 1&ndash;47.
doi:10.2143/RTPM.86.1.3285913</li>

<li>&ndash;&ndash;&ndash;, 2019b, &ldquo;The Priority of Natures
against The Identity of Indiscernibles: Alexander of Aphrodisias,
Ya&#7717;y&#257; b. &#703;Ad&#299;, and Avicenna on Genus as
Matter&rdquo;, <em>Journal of the History of Philosophy</em>, 57(2):
205&ndash;234. doi:10.1353/hph.2019.0023</li>

<li>&ndash;&ndash;&ndash;, 2020a, &ldquo;The Necessary Existent
(<em>w&#257;jib al-wuj&#363;d</em>): from Avicenna to Fa&#7723;r
al-D&#299;n al-R&#257;z&#299;&rdquo;, in Shihadeh and Thiele 2020:
123&ndash;155.</li>

<li>&ndash;&ndash;&ndash;, 2020b, &ldquo;Perceiving Things in
Themselves: Ab&#363; l-Barak&#257;t al-Ba&#289;d&#257;d&#299;&rsquo;s
Critique of Representationalism&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 30(2): 229&ndash;264.
doi:10.1017/S095742392000003X</li>

<li>&ndash;&ndash;&ndash;, 2022a, &ldquo;Meaning and Definition:
Scepticism and Semantics in Twelfth&#8208;Century Arabic
Philosophy&rdquo;, <em>Theoria</em>, 88(1): 72&ndash;108.
doi:10.1111/theo.12272</li>

<li>&ndash;&ndash;&ndash;, 2022b, &ldquo;Knowledge as a Mental State
in Mu&#703;tazilite Kal&#257;m&rdquo;, <em>Oriens</em>, 50(3&ndash;4):
244&ndash;279. doi:10.1163/18778372-12340016</li>

<li>Bertolacci, Amos, 2006, <em>The Reception of Aristotle&rsquo;s
<em>Metaphysics</em> in Avicenna&rsquo;s <em>Kit&#257;b
al-&Scaron;if&#257;&rsquo;</em>: A Milestone of Western Metaphysical
Thought</em>, Leiden: Brill. doi:10.1163/9789047408710</li>

<li>&ndash;&ndash;&ndash;, 2012, &ldquo;The Distinction of Essence and
Existence in Avicenna&rsquo;s Metaphysics: The Text and Its
Context&rdquo;, in Opwis and Reisman 2012: 257&ndash;288.
doi:10.1163/9789004217768_014</li>

<li>&ndash;&ndash;&ndash;, 2016, &ldquo;The Distinction of Essence and
Existence in Avicenna&rsquo;s Metaphysics: The Text and Its
Context,&rdquo; Islamic Philosophy, Science, Culture, and Religion:
Studies in Honor of Dimitri Gutas, Felicitas Opwis and David C.
Reisman (eds), Leiden: Brill, 257&ndash;88.</li>

<li>Black, Deborah L., 1997, &ldquo;Avicenna on the Ontological and
Epistemic Status of Fictional Beings&rdquo;, <em>Documenti e studi
sulla tradizione filosofica medievale</em>, 8: 425&ndash;453.</li>

<li>&ndash;&ndash;&ndash;, 2008, &ldquo;Al-F&#257;r&#257;b&#299; on
Meno&rsquo;s Paradox&rdquo;, in <em>In the Age of
al-F&#257;r&#257;b&#299;: Arabic Philosophy in the Fourth/Tenth
Century</em>, Peter Adamson (ed.), (Warburg Institute Colloquia 12),
London: Warburg Institute, 15&ndash;34</li>

<li>Chatti, Saloua, 2016, &ldquo;Existential Import in
Avicenna&rsquo;s Modal Logic&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 26(1): 45&ndash;71.
doi:10.1017/S0957423915000119</li>

<li>Dam&#257;vand&#299;, D&#257;ry&#363;sh, 2012, <em>Fakhr-i
R&#257;z&#299;</em>, Tehran: Intish&#257;r&#257;t-i
&#7788;&#257;hir.</li>

<li>De Haan, Daniel D., 2015, &ldquo;The Doctrine of the Analogy of
Being in Avicenna&rsquo;s <em>Metaphysics of the Healing</em>&rdquo;,
<em>The Review of Metaphysics</em>, 69(2): 261&ndash;286.</li>

<li>Dhanani, Alnoor, 1994, <em>The Physical Theory of Kal&#257;m:
Atoms, Space, and Void in Basrian Mu&#703;tazil&#299; Cosmology</em>,
Leiden: Brill.</li>

<li>&ndash;&ndash;&ndash;, 2015, &ldquo;The Impact of Ibn
S&#299;n&#257;&rsquo;s Critique of Atomism on Subsequent Kal&#257;m
Discussions of Atomism&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 25(1): 79&ndash;104.
doi:10.1017/S0957423914000101</li>

<li>Druart, Th&eacute;r&egrave;se-Anne, 2014, &ldquo;Ibn Sina and the
Ambiguity of Being&rsquo;s Univocity&rdquo;, in Mokdad Arfa Mensia
(ed.), <em>Views on the Philosophy of Ibn Sina and Mulla Sadra
Shirazi</em>, Carthage: The Tunisian Academy of Sciences, Letters and
Arts <em>Beit al-Hikma</em>, 15&ndash;24.</li>

<li>Eichner, Heidrun, 2007, &ldquo;Dissolving the unity of
metaphysics: From Fakhr al-D&#299;n al-R&#257;z&#299; to Mull&#257;
Sadr&#257; al-Sh&#299;r&#257;z&#299;&rdquo;, <em>Medioevo</em>, 32:
139&ndash;197.</li>

<li>&ndash;&ndash;&ndash;, 2009, <em>The Post-Avicennian Philosophical
Tradition and Islamic Orthodoxy: Philosophical and Theological Summae
in Context</em>, Habilitationsschrift, Universit&auml;t
Halle-Wittenberg.</li>

<li>&ndash;&ndash;&ndash;, 2011a, &ldquo;&lsquo;Knowledge by
Presence,&rsquo; Apperception and the Mind-Body Relationship. Fakhr
al-D&#299;n al-R&#257;z&#299; and al-Suhraward&#299; as
Representatives of a Thirteenth Century Discussion&rdquo;, in Adamson
2011b: 117&ndash;40.</li>

<li>&ndash;&ndash;&ndash;, 2011b, &ldquo;Essence and Existence.
Thirteenth-Century Perspectives in Arabic-Islamic Philosophy and
Theology&rdquo;, in Hasse and Bertolacci 2011: 123&ndash;52.</li>

<li>El Rouayheb, Khaled, 2012, &ldquo;Post-Avicennan Logicians on the
Subject Matter of Logic: Some Thirteenth- and Fourteenth-Century
Discussions,&rdquo; <em>Arabic Sciences and Philosophy</em> 22:
69&ndash;90.</li>

<li>&ndash;&ndash;&ndash;, 2019, <em>The Development of Arabic Logic
(1200&ndash;1800)</em>, Basel: Schwabe.</li>

<li>Falaturi, A. Djavad, 1969, &ldquo;Fakhr al-Din al-Razi&rsquo;s
Critical Logic&rdquo;, in M. Minuvi (ed.), <em>Y&#257;dn&#257;mah-yi
&#299;ran&#299;-yi Minorsky</em>, Tehran: Intish&#257;r&#257;t-i
d&#257;nishgah-i Tihr&#257;n, 51&ndash;79.</li>

<li>Griffel, Frank, 2007, &ldquo;On Fakhr al-D&#299;n
al-R&#257;z&#299;&rsquo;s Life and the Patronage He Received&rdquo;,
<em>Journal of Islamic Studies</em>, 18(3): 313&ndash;344.
doi:10.1093/jis/etm029</li>

<li>&ndash;&ndash;&ndash;, 2011, &ldquo;Between al-Ghaz&#257;l&#299;
and Ab&#363; l-Barak&#257;t al-Baghd&#257;d&#299;. The dialectical
turn in the philosophy of Iraq and Iran during the 6th/12th
century&rdquo;, in Adamson 2011b: 45&ndash;75.</li>

<li>&ndash;&ndash;&ndash;, 2021, <em>The Formation of Post-Classical
Philosophy in Islam</em>, Oxford: Oxford University Press.
doi:10.1093/oso/9780190886325.001.0001</li>

<li>Gutas, Dimitri, 2002, &ldquo;The Heritage of Avicenna: the Golden
Age of Arabic Philosophy, 900&ndash;ca.1350&rdquo;, in Jules Janssens
and Daniel De Smet (eds), <em>Avicenna and his Heritage</em>, Leuven:
Leuven University Press, 81&ndash;98.</li>

<li>Hasse, Dag Nikolaus and Amos Bertolacci (eds.), 2011, <em>The
Arabic, Hebrew and Latin Reception of Avicenna&rsquo;s
Metaphysics</em>, (Scientia Graeco-Arabica 7), Berlin: De Gruyter.
doi:10.1515/9783110215762</li>

<li>Ibrahim, Bilal, 2013, &ldquo;Fa&#7723;r Ad-D&#299;n
Ar-R&#257;z&#299;, Ibn al-Hay&#7791;am and Aristotelian Science:
Essentialism versus Phenomenalism in Post-Classical Islamic
Thought&rdquo;, <em>Oriens</em>, 41(3&ndash;4): 379&ndash;431.
doi:10.1163/18778372-13413407</li>

<li>&ndash;&ndash;&ndash;, 2020, &ldquo;Beyond Atoms and Accidents:
Fakhr al-D&#299;n al-R&#257;z&#299; and the New Ontology of
Postclassical Kal&#257;m&rdquo;, <em>Oriens</em>, 48(1&ndash;2):
67&ndash;122. doi:10.1163/18778372-04801004</li>

<li>Jacobsen Ben Hammed, Nora, 2020, &ldquo;Meno&rsquo;s Paradox and
First Principles in Fakhr al-D&#299;n al-R&#257;z&#299;&rdquo;,
<em>Oriens</em>, 48(3&ndash;4): 320&ndash;344.
doi:10.1163/18778372-04801101</li>

<li>Jaffer, Tariq, 2015, <em>R&#257;z&#299;: Master of
Qur&#700;&#257;nic Interpretation and Theological Reasoning</em>,
Oxford/New York: Oxford University Press.</li>

<li>Janos, Damien, 2015, &ldquo;Intuition, Intellection, and Mystical
Knowledge: Delineating Fakhr al-D&#299;n al-R&#257;z&#299;&rsquo;s
Cognitive Theories&rdquo;, in <em>Islam and Rationality, The Impact of
al-Ghaz&#257;l&#299;. Papers Collected on His 900th Anniversary</em>,
vol. 2, Frank Griffel (ed.), Leiden: Brill, 189&ndash;228.</li>

<li>&ndash;&ndash;&ndash;, 2020, <em>Avicenna on the Ontology of Pure
Quiddity</em>, Berlin: De Gruyter. doi:10.1515/9783110652086</li>

<li>&ndash;&ndash;&ndash;, 2021, &ldquo;Avicenna on Equivocity and
Modulation: A Reconsideration of the <em>asm&#257;&#702;
mushakkika</em> (and <em>tashk&#299;k al-wuj&#363;d</em>)&rdquo;,
<em>Oriens</em>, 50(1&ndash;2): 1&ndash;62.
doi:10.1163/18778372-12340003</li>

<li>Kaya, Mehmet C&uuml;neyt, 2014, &ldquo;In the Shadow of
&lsquo;Prophetic Legislation&rsquo;: The Venture of Practical
Philosophy after Avicenna&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 24(2): 269&ndash;296.
doi:10.1017/S0957423914000034</li>

<li>Kholeif, Fathalla, 1966, <em>A Study on Fakhr al-D&#299;n
al-R&#257;z&#299; and his Controversies in Transoxiana</em>, Beirut:
Dar el-Machreq.</li>

<li>&ndash;&ndash;&ndash;, 1969, <em>Fakhr al-D&#299;n
al-R&#257;z&#299;</em>, Cairo: al-J&#257;mi&#703;&#257;t
al-Mi&#7779;riyya.</li>

<li>Kaukua, Jari, 2016, &ldquo;Self, Agent, Soul: Ab&#363;
al-Barak&#257;t al-Baghd&#257;d&#299;&rsquo;s Critical Reception of
Avicennian Psychology&rdquo;, in <em>Subjectivity and Selfhood in
Medieval and Early Modern Philosophy</em>, Jari Kaukua and Tomas
Ekenberg (eds.), (Studies in the History of Philosophy of Mind 16),
Cham: Springer International Publishing, 75&ndash;89.
doi:10.1007/978-3-319-26914-6_6</li>

<li>&ndash;&ndash;&ndash;, 2020, &ldquo;Post-Classical Islamic
Philosophy&#8239;? A Contradiction in Terms?&rdquo;, <em>Nazariyat:
Journal for the History of Islamic Philosophy and Sciences</em>, 6(2):
1&ndash;21. doi:10.12658/nazariyat.6.2.m0110</li>

<li>Lameer, Joep, 2006, <em>Conception and Belief in Sadr al-Din
Shirazi</em>, Tehran: Iranian Institute of Philosophy.</li>

<li>&ndash;&ndash;&ndash;, 2014, &ldquo;&#8238;&#1594;&#1740;&#1585;
&#1575;&#1604;&#1605;&#1593;&#1604;&#1608;&#1605;
&#1740;&#1605;&#1578;&#1606;&#1593;
&#1575;&#1604;&#1581;&#1705;&#1605;
&#1593;&#1604;&#1740;&#1607;&#8236; (<em>Ghayr al-ma&#703;l&#363;m
yamtani&#703; al-&#7717;ukm &#703;alayhi</em>): An Exploratory
Anthology of a False Paradox in Medieval Islamic Philosophy&rdquo;,
<em>Oriens</em>, 42(3&ndash;4): 397&ndash;453.
doi:10.1163/18778372-04203005</li>

<li>Lammer, Andreas, 2018, <em>The Elements of Avicenna&rsquo;s
Physics: Greek Sources and Arabic Innovations</em>, (Scientia
Graeco-Arabica 20), Berlin/Boston: De Gruyter.
doi:10.1515/9783110546798</li>

<li>Lettinck, Paul, 1988, &ldquo;Ibn S&#299;n&#257; on Atomism:
Translation of Ibn S&#299;n&#257;&rsquo;s <em>Kit&#257;b
al-Shif&#257;&#702;, al-&#7788;ab&#299;&#703;iyy&#257;t 1:
al-Sam&#257;&#703; al-&#7789;ab&#299;&#703;&#299;</em> Third Treatise,
Chapters 3&ndash;5&rdquo;, <em>Al-Shajarrah</em>, 4: 1&ndash;51.</li>

<li>Marmura, Michael E., 1980, &ldquo;Avicenna&rsquo;s Proof from
Contingency for God&rsquo;s Existence in the Metaphysics of the
&lsquo;Shif&#257;&rsquo;&rsquo;&rdquo;, <em>Mediaeval Studies</em>,
42: 337&ndash;352. doi:10.1484/J.MS.2.306261</li>

<li>&ndash;&ndash;&ndash;, 1991, &ldquo;Fakhr al-D&#299;n
al-R&#257;z&#299;&rsquo;s Critique of an Avicennan
<em>Tanb&#299;h</em>&rdquo;, in Burkhard Mojsisch and Olaf Pluta
(eds), <em>Historia Philosophiae Medii Aevi: Studien zur Geschichte
der Philosophie des Mittelalters</em>, vol. 2, Amsterdam: B. R.
Gr&uuml;ner, 627&ndash;41.</li>

<li>&ndash;&ndash;&ndash;, 2005, &ldquo;Some Aspects of
Avicenna&rsquo;s Theory of God&rsquo;s Knowledge of
Particulars&rdquo;, in <em>Probing in Islamic Philosophy: Studies in
The Philosophies of Ibn Sina, Al-Ghazali and Other Major Muslim
Thinkers</em>, Michael Marmura (ed.), New York, Global Academic
Publishing, Binghamton University, 71&ndash;96.</li>

<li>&ndash;&ndash;&ndash;, 2009, &ldquo;Avicenna on Meno&rsquo;s
Paradox: On Apprehending Unknown Things Through Known Things&rdquo;,
<em>Mediaeval Studies</em>, 71: 47&ndash;62.</li>

<li>Mayer, Toby, 2001, &ldquo;Ibn S&#299;n&#257;&rsquo;s
<em>Burh&#257;n al-&#7778;idd&#299;q&#299;n</em>&rdquo;, <em>Journal
of Islamic Studies</em>, 12(1): 18&ndash;39.
doi:10.1093/jis/12.1.18</li>

<li>&ndash;&ndash;&ndash;, 2003, &ldquo;Fa&#7723;r ad-D&#299;n
ar-R&#257;z&#299;&rsquo;s Critique of Ibn S&#299;n&#257;&rsquo;s
Argument for the Unity of God in the <em>I&scaron;&#257;r&#257;t</em>
and Na&#7779;&#299;r ad-D&#299;n a&#7789;-&#7788;&#363;s&#299;&rsquo;s
Defence&rdquo;, in Before and After Avicenna: Proceedings of the First
Conference of the Avicenna Study Group, David Colum Reisman and Ahmed
H. Al-Rahim (eds.), Leiden: Brill, 199&ndash;218.
doi:10.1163/9789047402022_012</li>

<li>&ndash;&ndash;&ndash;, 2007, &ldquo;Avicenna Against Time
Beginning: The Debate between the Commentators on the
<em>Ish&#257;r&#257;t</em>&rdquo;, in <em>Classical Arabic Philosophy:
Sources and Reception</em>, Peter Adamson (ed.), London: Warburg
Institute, 125&ndash;149.</li>

<li>McGinnis, Jon, 2003, &ldquo;The Topology of Time: An Analysis of
Medieval Islamic Accounts of Discrete and Continuous Time&rdquo;:,
<em>The Modern Schoolman</em>, 81(1): 5&ndash;25.
doi:10.5840/schoolman20038111</li>

<li>&ndash;&ndash;&ndash;, 2008, &ldquo;Time to Change: Time, Motion
and Possibility in Ibn S&#299;n&#257;&rdquo;, in Mehmet Mazak and
Nevzat &Ouml;zkaya (eds), <em>Uluslararas&#305; &#304;bn
S&icirc;n&acirc; Sempozyumu Bildirileri</em>, Istanbul: Istanbul
B&uuml;y&uuml;k&#351;eh&#305;r Belediyesi, vol. 1, 251&ndash;7.</li>

<li>&ndash;&ndash;&ndash;, 2013, &ldquo;Avicenna&rsquo;s Natural
Philosophy&rdquo;, in <em>Interpreting Avicenna: Critical Essays</em>,
Peter Adamson (ed.), Cambridge: Cambridge University Press,
71&ndash;90. doi:10.1017/CBO9781139047890.005</li>

<li>&ndash;&ndash;&ndash;, 2019, &ldquo;A Continuation of Atomism:
Shahrast&#257;n&#299; on the Atom and Continuity&rdquo;, <em>Journal
of the History of Philosophy</em>, 57(4): 595&ndash;619.
doi:10.1353/hph.2019.0068</li>

<li>Noble, Michael-Sebastian, 2021, <em>Philosophising the Occult:
Avicennan Psychology and &ldquo;The Hidden Secret&rdquo; of Fakhr
al-D&#299;n al-R&#257;z&#299;</em>, Berlin: De Gruyter.
doi:10.1515/9783110648096</li>

<li>Nusseibeh, Sari, 2009, &ldquo;Avicenna: Providence and God&rsquo;s
Knowledge of Particulars&rdquo;, in <em>Avicenna and His Legacy: A
Golden Age of Science and Philosophy</em>, Y. Tzvi Langermann (ed.),
(Cultural Encounters in Late Antiquity and the Middle Ages 8),
Turnhout, Belgium: Brepols, 275&ndash;288.</li>

<li>Opwis, Felicitas, 2012, &ldquo;Attributing Causality to
God&rsquo;s Law: The Solution of Fa&#7723;r ad-D&#299;n
ar-R&#257;z&#299;&rdquo;, in Opwis and Reisman 2012: 397&ndash;418.
doi:10.1163/9789004217768_019</li>

<li>Opwis, Felicitas and David Reisman (eds.), 2012, <em>Islamic
Philosophy, Science, Culture, and Religion: Studies in Honor of
Dimitri Gutas</em>, Leiden: Brill. doi:10.1163/9789004217768</li>

<li>&Ouml;zturan, Mehmet, 2018, &ldquo;An Introduction to the Critique
of the Theory of Definition in Arabic Logic: Is Complete Definition
Circular?&rdquo;, <em>Nazariyat &#304;slam Felsefe ve Bilim Tarihi
Ara&#351;t&#305;rmalar&#305; Dergisi (Journal for the History of
Islamic Philosophy and Sciences)</em>, 4(3): 85&ndash;117.
doi:10.12658/Nazariyat.4.3.M0062en</li>

<li>Radhi Ibrahim, Mohd, 2013, &ldquo;Immediate Knowledge According to
Al-Q&#257;&#7693;&#299; &#703;Abd al-Jabb&#257;r&rdquo;, <em>Arabic
Sciences and Philosophy</em>, 23(1): 101&ndash;115.
doi:10.1017/S0957423912000094</li>

<li>Sabra, Abdelhamid I., 2006, &ldquo;<em>Kal&#257;m</em> Atomism as
an Alternative Philosophy to Hellenizing <em>Falsafa</em>&rdquo;, in
<em>Arabic Theology, Arabic Philosophy: From the Many to the One:
Essays in Celebration of Richard M. Frank</em>, James E. Montgomery
(ed.), (Orientalia Lovaniensia Analecta 152), Leuven/Dudley, MA:
Uitgeverij Peeters en Department Ossterse Studies, 199&ndash;272.</li>

<li>Setia, Adi, 2004, &ldquo;Fakhr al-D&#299;n al-R&#257;z&#299; on
Physics and the Nature of the Physical World: A Preliminary
Survey&rdquo;, <em>Islam &amp; Science</em> (now <em>Islamic
Sciences</em>), 2(2): 161&ndash;180.</li>

<li>&ndash;&ndash;&ndash;, 2006, &ldquo;Atomism Versus Hylomorphism in
the <em>Kal&#257;m</em> of al-Fakhr al-D&#299;n al-R&#257;z&#299;: A
Preliminary Survey of the <em>Ma&#7789;&#257;lib
al-&#703;&#257;liyyah</em>&rdquo;, <em>Islam &amp; Science</em>, 4(2):
113&ndash;140.</li>

<li>&ndash;&ndash;&ndash;, 2008, &ldquo;Time, Motion, Distance, and
Change in the <em>Kal&#257;m</em> of Fakhr al-D&#299;n
al-R&#257;z&#299;: A Preliminary Survey with Special Reference to the
<em>Ma&#7789;&#257;lib &#703;&#257;liyyah</em>&rdquo;, <em>Islam &amp;
Science</em>, 6(1): 13&ndash;29.</li>

<li>Al-Shaar, Nuha, 2012, &ldquo;An Islamic Approach to Moral Virtue:
Fakhr al-D&#299;n al-R&#257;z&#299;&rsquo;s Treatment of <em>Birr</em>
(Virtue) in his <em>al-Tafs&#299;r al-Kab&#299;r</em>&rdquo;,
<em>M&eacute;langes de l&rsquo;Universit&eacute; Saint-Joseph</em>,
64: 87&ndash;100.</li>

<li>Shihadeh, Ayman, 2005, &ldquo;From Al-Ghaz&#257;l&#299; to
al-R&#257;z&#299;: 6th/12th Century Developments in Muslim
Philosophical Theology&rdquo;, <em>Arabic Sciences and
Philosophy</em>, 15(1): 141&ndash;179.
doi:10.1017/S0957423905000159</li>

<li>&ndash;&ndash;&ndash;, 2006, <em>The Teleological Ethics of Fakhr
al-D&#299;n al-R&#257;z&#299;</em>, Leiden: Brill.
doi:10.1163/9789047409007</li>

<li>&ndash;&ndash;&ndash;, 2014, &ldquo;Fakhr al-D&#299;n
al-R&#257;z&#299;&rsquo;s response to Sharaf al-D&#299;n
al-Mas&#703;&#363;d&#299;&rsquo;s critical commentary on
Avicenna&rsquo;s <em>Ish&#257;r&#257;t</em>&rdquo;, <em>The Muslim
World</em>, 104(1&ndash;2): 1&ndash;61. doi:10.1111/muwo.12037</li>

<li>&ndash;&ndash;&ndash;, 2016, &ldquo;Theories of Ethical Value in
Kal&#257;m: A New Interpretation&rdquo;, in <em>The Oxford Handbook of
Islamic Theology</em>, Sabine Schmidtke (ed.), Oxford: Oxford
University Press, 384&ndash;407.</li>

<li>&ndash;&ndash;&ndash;, 2017, &ldquo;Al-R&#257;z&#299;&rsquo;s (d.
1210) commentary on Avicenna&rsquo;s <em>Pointers</em>: The confluence
of exegesis and aporetics&rdquo;, in <em>The Oxford Handbook of
Islamic Philosophy</em>, Khaled El-Rouayheb and Sabine Schmidtke
(eds), Oxford: Oxford University Press, 286&ndash;325.</li>

<li>&ndash;&ndash;&ndash;, 2019, &ldquo;Avicenna&rsquo;s Theodicy and
al-R&#257;z&#299;&rsquo;s Anti-Theodicy&rdquo;, <em>Intellectual
History of the Islamicate World</em>, 7: 61&ndash;84.
doi:10.1163/2212943X-00701004</li>

<li>&ndash;&ndash;&ndash;, 2022, &ldquo;Fakhr al-D&#299;n
al-R&#257;z&#299; and Gh&#363;rid Self-Fashioning&rdquo;,
<em>Afghanistan</em>, 5(2): 253&ndash;292.
doi:10.3366/afg.2022.0095</li>

<li>Shihadeh, Ayman and Jan Thiele (eds), 2020, <em>Philosophical
Theology in Islam: Later Ash&#699;arism East and West</em>,
(Islamicate Intellectual History 5), Leiden/Boston: Brill.</li>

<li>Street, Tony, 1997, &ldquo;Concerning the Life and Works of Fakhr
al-D&#299;n al-R&#257;z&#299;&rdquo;, in <em>Islam: Essays on
Scripture, Thought and Society: A Festschrift in Honour of Anthony H.
Johns</em>, Peter Riddell and Tony Street (eds), Leiden: Brill,
135&ndash;146. doi:10.1163/9789004452091_013</li>

<li>&ndash;&ndash;&ndash;, 2005, &ldquo;Fa&#7723;raddin
ar-R&#257;z&#299;&rsquo;s Critique of Avicennan Logic&rdquo;, in
<em>Logik und Theologie: Das Organon im arabischen und im lateinischen
Mittelalter</em>, Dominik Perler and Ulrich Rudolph (eds), Leiden:
Brill, 99&ndash;116. doi:10.1163/9789047403982_007</li>

<li>&ndash;&ndash;&ndash;, 2010, &ldquo;Appendix: Readings of the
Subject Term&rdquo;, <em>Arabic Sciences and Philosophy</em>, 20(1):
119&ndash;124. doi:10.1017/S0957423909990117</li>

<li>&ndash;&ndash;&ndash;, 2014, &ldquo;Af&#7693;al Al-D&#299;n
al-Kh&#363;naj&#299; (d. 1248) on the Conversion of Modal
Propositions&rdquo;, <em>Oriens</em>, 42(3&ndash;4): 454&ndash;513.
doi:10.1163/18778372-04203006</li>

<li>&ndash;&ndash;&ndash;, 2016, &ldquo;Al-&#703;All&#257;ma
al-&#7716;ill&#299; (d. 1325) and the Early Reception of
K&#257;tib&#299;&rsquo;s <em>Shams&#299;ya</em>: Notes towards a Study
of the Dynamics of Post-Avicennan Logical Commentary&rdquo;,
<em>Oriens</em>, 44(3&ndash;4): 267&ndash;300.
doi:10.1163/18778372-04403004</li>

<li>Strobino, Riccardo and Paul Thom, 2016, &ldquo;The Logic of
Modality&rdquo;, in <em>The Cambridge Companion to Medieval
Logic</em>, Catarina Dutilh Novaes and Stephen Read (eds), Cambridge:
Cambridge University Press, 342&ndash;369.
doi:10.1017/CBO9781107449862.015</li>

<li>Treiger, Alexander, 2012, &ldquo;Avicenna&rsquo;s Notion of
Transcendental Modulation of Existence (ta&scaron;k&#299;k
al-wuj&#363;d, analogia entis) and its Greek and Arabic
Sources,&rdquo; in <em>Islamic Philosophy, Science, Culture, and
Religion: Studies in Honor of Dimitri Gutas</em>, Felicitas Opwis and
David C. Reisman (eds), Leiden: Brill, 327&ndash;63.</li>

<li>T&uuml;rker, &Ouml;mer and Osman Demir, 2011, <em>&#304;sl&acirc;m
D&uuml;&#351;&uuml;ncesinin D&ouml;n&uuml;&#351;&uuml;m
&Ccedil;a&#287;&#305;nda Fahreddin er-R&acirc;z&icirc;</em>,
&#304;stanbul: &#304;sam Yay&#305;nlar&#305;. [Collection of articles
on Fakhr al-D&#299;n.]</li>

<li>Virgi, Sarah, 2022, &ldquo;The Mouse&rsquo;s Tale:
Al-J&#257;&#7717;i&#7827;, Ab&#363; Bakr al-R&#257;z&#299;, and Fakhr
al-D&#299;n al-R&#257;z&#299; on Animal Thinking&rdquo;, <em>British
Journal for the History of Philosophy</em>, 30(5): 751&ndash;772.
doi:10.1080/09608788.2022.2049203</li>

<li>Wisnovsky, Robert,&nbsp;2004, &ldquo;One Aspect of the Avicennian
Turn in Sunni&#772; Theology&rdquo;, <em>Arabic Sciences and
Philosophy</em> 14: 65&ndash;100.</li>

<li>&ndash;&ndash;&ndash;, 2012, &ldquo;Essence and Existence in the
Eleventh- and Twelfth-Century Islamic East (<em>Ma&scaron;riq</em>): A
Sketch&rdquo;, in Hasse and Bertolacci 2011: 27&ndash;50.</li>

<li>&ndash;&ndash;&ndash;, 2013, &ldquo;Avicennism and Exegetical
Practice in the Early Commentaries on the
<em>Ish&#257;r&#257;t</em>&rdquo;, <em>Oriens</em>, 41(3&ndash;4):
349&ndash;378. doi:10.1163/18778372-13413406</li>

<li>Zamboni, Francesco, 2020, &ldquo;Is Existence One or Manifold?
Avicenna and His Early Interpreters on the Modulation of Existence
(<em>ta&scaron;k&#299;k al-wu&#487;&#363;d</em>)&rdquo;, <em>Documenti
e studi sulla tradizione filosofica medievale</em>, 31:
121&ndash;149.</li>

<li>Zarepour, Mohammad Saleh, 2022, <em>Necessary Existence and
Monotheism: An Avicennian Account of the Islamic Conception of Divine
Unity</em>, Cambridge: Cambridge University Press.
doi:10.1017/9781108938112</li>

<li>al-Zark&#257;n, Mu&#7717;ammad &#7778;., 1963, <em>Fakhr
al-D&#299;n al-R&#257;z&#299; wa-&#257;r&#257;&#702;uh&#363;
al-kal&#257;miyya wa-l-falsafiyya</em>, Cairo: D&#257;r al-Fikr
li-l-&#7788;ab&#257;&#703;a wa-l-Nashr wa-l-Tawz&#299;&#703;.</li>
</ul>
</div> 

<div id="academic-tools">
<h2 id="Aca">Academic Tools</h2>

<blockquote>
<table class="vert-top">
<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/archinfo.cgi?entry=al-din-al-razi" target="other">How to cite this entry</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/sepman-icon.jpg" alt="sep man icon" /></td>
<td><a href="https://leibniz.stanford.edu/friends/preview/al-din-al-razi/" target="other">Preview the PDF version of this entry</a> at the
 <a href="https://leibniz.stanford.edu/friends/" target="other">Friends of the SEP Society</a>.</td>
</tr>

<tr>
<td><img src="../../symbols/inpho.png" alt="inpho icon" /></td>
<td><a href="https://www.inphoproject.org/entity?sep=al-din-al-razi&amp;redirect=True" target="other">Look up topics and thinkers related to this entry</a>
 at the Internet Philosophy Ontology Project (InPhO).</td>
</tr>

<tr>
<td><img src="../../symbols/pp.gif" alt="phil papers icon" /></td>
<td><a href="https://philpapers.org/sep/al-din-al-razi/" target="other">Enhanced bibliography for this entry</a>
at <a href="https://philpapers.org/" target="other">PhilPapers</a>, with links to its database.</td>
</tr>

</table>
</blockquote>
</div>

<div id="other-internet-resources">

<h2 id="Oth">Other Internet Resources</h2>

<ul>

 <li><a href="https://historyofphilosophy.net/fakhr-al-din-al-razi" target="other">For the Sake of Argument: Fahkr al-D&#299;n</a>,
 episode at the History of Philosophy podcast website.</li>

 <!--LINK CHECKER COMMENTED OUT (Sun Sep 17 11:47:50 PDT 2023)

<li><a href="https://uni-tuebingen.de/fakultaeten/philosophische-fakultaet/fachbereiche/asien-orient-wissenschaften/orient-islamwissenschaft/abteilung/personen/heidrun-eichner/post-avicennan-summae/fakhr-al-din-al-razi/" target="other">List of digitized manuscripts of works by Fakhr al-D&#299;n</a>,
 at the University of T&uuml;bingen</li>

LINK CHECKER-->

 <li><a href="https://islamsci.mcgill.ca/RASI/pipdi.html" target="other">Post-classical Islamic Philosophy Database Initiative</a>,
 at McGill University</li>
</ul>
</div>

<div id="related-entries">

<h2 id="Rel">Related Entries</h2>

<p>

 <!--<a href="../abu-lbarakat/">-->Ab&#363; l-Barak&#257;t<!--</a>--> |
 <a href="../aristotle-logic/">Aristotle, General Topics: logic</a> |
 <a href="../ibn-sina/">Ibn Sina [Avicenna]</a> |
 <a href="../ibn-sina-metaphysics/">Ibn Sina [Avicenna]: metaphysics</a> |
 <a href="../suhrawardi/">Suhrawardi</a>

</p>
</div>

<div id="acknowledgments">

<h3>Acknowledgments</h3>

<p>
Our thanks to Hanif Amin Beidokhti, Merve Boz, Damien Janos, Andreas
Lammer, Michael Sebastian Noble, and Sarah Virgi for help with this
article.</p>
</div> 
</div><!-- #aueditable --><!--DO NOT MODIFY THIS LINE AND BELOW-->

<!-- END ARTICLE HTML -->

</div> <!-- End article-content -->

  <div id="article-copyright">
    <p>
 <a href="../../info.html#c">Copyright &copy; 2023</a> by

<br />
<a href="https://www.philosophie.uni-muenchen.de/lehreinheiten/philosophie_6/personen/adamson/index.html" target="other">Peter Adamson</a>
&lt;<a href="m&#97;ilto:peter&#37;2eadamson&#37;40lrz&#37;2euni-muenchen&#37;2ede"><em>peter<abbr title=" dot ">&#46;</abbr>adamson<abbr title=" at ">&#64;</abbr>lrz<abbr title=" dot ">&#46;</abbr>uni-muenchen<abbr title=" dot ">&#46;</abbr>de</em></a>&gt;<br />
Fedor Benevich
&lt;<a href="m&#97;ilto:Fedor&#37;2eBenevich&#37;40ed&#37;2eac&#37;2euk"><em>Fedor<abbr title=" dot ">&#46;</abbr>Benevich<abbr title=" at ">&#64;</abbr>ed<abbr title=" dot ">&#46;</abbr>ac<abbr title=" dot ">&#46;</abbr>uk</em></a>&gt;
    </p>
  </div>

</div> <!-- End article -->

<!-- NOTE: article banner is outside of the id="article" div. -->
<div id="article-banner" class="scroll-block">
  <div id="article-banner-content">
    <a href="../../fundraising/">
    Open access to the SEP is made possible by a world-wide funding initiative.<br />
    The Encyclopedia Now Needs Your Support<br />
    Please Read How You Can Help Keep the Encyclopedia Free</a>
  </div>
</div> <!-- End article-banner -->

    </div> <!-- End content -->

    <div id="footer">

      <div id="footer-menu">
        <div class="menu-block">
          <h4><i class="icon-book"></i> Browse</h4>
          <ul role="menu">
            <li role="menuitem"><a href="../../contents.html">Table of Contents</a></li>
            <li role="menuitem"><a href="../../new.html">What's New</a></li>
            <li role="menuitem"><a href="https://plato.stanford.edu/cgi-bin/encyclopedia/random">Random Entry</a></li>
            <li role="menuitem"><a href="../../published.html">Chronological</a></li>
            <li role="menuitem"><a href="../../archives/">Archives</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-info-sign"></i> About</h4>
          <ul role="menu">
            <li role="menuitem"><a href="../../info.html">Editorial Information</a></li>
            <li role="menuitem"><a href="../../about.html">About the SEP</a></li>
            <li role="menuitem"><a href="../../board.html">Editorial Board</a></li>
            <li role="menuitem"><a href="../../cite.html">How to Cite the SEP</a></li>
            <li role="menuitem"><a href="../../special-characters.html">Special Characters</a></li>
            <li role="menuitem"><a href="../../tools/">Advanced Tools</a></li>
            <li role="menuitem"><a href="../../accessibility.html">Accessibility</a></li>
            <li role="menuitem"><a href="../../contact.html">Contact</a></li>
          </ul>
        </div>
        <div class="menu-block">
          <h4><i class="icon-leaf"></i> Support SEP</h4>
          <ul role="menu">
            <li role="menuitem"><a href="../../support/">Support the SEP</a></li>
            <li role="menuitem"><a href="../../support/friends.html">PDFs for SEP Friends</a></li>
            <li role="menuitem"><a href="../../support/donate.html">Make a Donation</a></li>
            <li role="menuitem"><a href="../../support/sepia.html">SEPIA for Libraries</a></li>
          </ul>
        </div>
      </div> <!-- End footer menu -->

      <div id="mirrors">
        <div id="mirror-info">
          <h4><i class="icon-globe"></i> Mirror Sites</h4>
          <p>View this site from another server:</p>
        </div>
        <div class="btn-group open">
          <a class="btn dropdown-toggle" data-toggle="dropdown" href="https://plato.stanford.edu/">
            <span class="flag flag-usa"></span> USA (Main Site) <span class="caret"></span>
            <span class="mirror-source">Philosophy, Stanford University</span>
          </a>
          <ul class="dropdown-menu">
            <li><a href="../../mirrors.html">Info about mirror sites</a></li>
          </ul>
        </div>
      </div> <!-- End mirrors -->
      
      <div id="site-credits">
        <p>The Stanford Encyclopedia of Philosophy is <a href="../../info.html#c">copyright &copy; 2023</a> by <a href="https://mally.stanford.edu/">The Metaphysics Research Lab</a>, Department of Philosophy, Stanford University</p>
        <p>Library of Congress Catalog Data: ISSN 1095-5054</p>
      </div> <!-- End site credits -->

    </div> <!-- End footer -->

  </div> <!-- End container -->

   <!-- NOTE: Script required for drop-down button to work (mirrors). -->
  <script>
    $('.dropdown-toggle').dropdown();
  </script>

</body>
</html>
